//239
var a
var go1
var go2
var go3
var gogogo
var gooo
var g
// <br>
// var q10032 = `<a href="">해당모의고사바로가기</a><br><img src="img/g/.png"><br>`
// <img src="img/g/.png"><br>

var q10004 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go1/kor_mun_95E6MNHQ.pdf">해당모의고사다운로드</a><br>
‘세계’는 그것을 대면한 각 인식 주체들에 의해 다양하게
드러난다. 가장 일차적이고 일반적인 세계는 우리가 경험하
는 현실 세계이며, 인식 주체들은 각자가 지닌 조건에 따라
현실 세계를 다양하게 인식한다. 한 예로, 각 인식 주체는 서
로 다른 가시 및 가청 범위를 가지며, 이러한 신체적 지각의
차이에 따라 그들이 경험하는 세계에 대한 인식도 각기 달라
진다. 또한 인식 주체는 일상 언어를 바탕으로 현실 세계를
인식한다. 예를 들어 연속된 시간을 시, 분으로 표현하는 것
처럼 일상 언어는 연속된 세계를 분절하여 인식하게 만든다.<br> 그런데 신체적 지각이나 일상 언어는 고정적이지 않다. 운
동선수처럼 반복적 수련을 하거나 안경 등의 도구를 이용하
면 인식 주체들이 지닌 조건은 달라질 수 있으며, 새로 도
입된 낯선 언어가 시간이 흐르면서 일상 언어로 자리 잡기도
한다.<br> 인식 주체들에 의해 드러나는 각각의 세계는 세계 전체를
이루는 여러 얼굴이라 할 수 있다. 인식 주체들의 인식 조건
은 다양하므로 각각의 인식틀에 따라 저마다의 얼굴, 즉 각
각의 존재면이 드러나게 된다. 그런 의미에서 회화 예술은 세
계의 다양한 존재면을 드러내는 작업이다.<br> 의식 수준이 성장함에 따라 인간은 점차 현실 세계의 현상
너머에 있는 형이상학적인 것을 갈망하게 되었다. 이런 경향
은 현대회화에도 영향을 끼쳤으며, 회화에서 현실 세계를
다루는 양상에도 변화가 나타났다. 현대회화의 존재적 특징은
과학과의 비교를 통해 분명해진다. 과학은 존재면이 비교적
일의적이며, 한 존재면을 수직으로 파고들어 그 면을 심층적
으로 드러낸다. 예를 들어 생물학은 종, 개체, 기관, 세포, 유
전자 등 무수한 면들을 드러내나, 이 면들은 넓게 보면 같은
면의 객관적 심층이다. 그러나 현대회화는 여러 존재면을 수
평적으로 드러낸다. 예를 들어 입체주의나 표현주의 현대회
화를 보면, 하나의 그림 위에 일상의 현실 세계와 상상에 의
한 가능 세계가 혼재해 있음을 알 수 있다. 현실 세계의 실재를 있는 그대로 재현하고자 했던 전통회화와 달리 현대
회화는 변형과 과장을 통해 실재와는 다른 방식으로 세계들을
조합해 나간 것이다. 이러한 현대회화의 추상성은 처음에는
혁신적이었으나 점차 보편적인 것이 되었다.<br> 추상의 강도가 더해질수록 현대회화는 실재의 재현에서 더
욱 멀어져, 실재가 아닌 화가의 내면을 표현하는 것으로 인
식되었다. 내면은 상상의 영역이기에, 전통회화와 달리 현대
회화로는 현실 세계의 존재면을 드러내기 어렵다는 인식도 생
겨났다. 그러나 현대회화의 추상성에 대해 실재는 배제한 채
내면만 표현한 것이라고 이분법적으로 이해하는 것은 적절하
지 않다. 상상의 대부분은 현실의 경험에서 비롯되며, 내면
의 추상적 영역 또한 객관적 실재의 외면을 이질적으로 변형
시켜 존재를 다양하게 드러내는, 세계의 무수한 존재면 중 하
나이기 때문이다. 회화를 통해 접하는 다양한 가능 세계와의
만남은 우리를 현실 세계에 더 가까이 다가가게 해 준다.
`
var q10005 = ` <a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go1/kor_mun_95E6MNHQ.pdf">해당모의고사다운로드</a><br>
회화는 캔버스 위에 물감으로 색과 형태를 드러낸 가시적
존재지만, 회화의 의미가 창작자의 주관이나 감상자의 주관
에 따라 다양하게 형성된다는 점에서 비가시적 존재이기도
하다. 이렇듯 회화는 가시적이면서 동시에 비가시적인 독특
한 존재 방식을 갖는다.<br> 전통회화는 회화의 가시적 속성을 통해 객관적 세계의 외
면을 사실적으로 재현하는 데 주목했다. 이에 반해 현대회화
는 회화의 가시적 속성을 통해 화가의 비가시적 내면을 드러
내는 데 치중한다. 현대회화는 화가들이 자신만의 관념적 세
계를 가시화한 결과물로서, 회화 속에서 객관적 실재는 주관
화된다. 현대회화의 화가들은 현실에서 목격하는 일상의 모
습이 비대칭적이고 혼란스럽더라도 임의로 대칭을 만들거나
현실을 조작하는 등의 방법으로 비현실적 허구를 표현해 내
고자 했다. 이렇게 예술을 통해 현실이 추상화되는 과정에서
예술은 객관적 현실로부터 점차 멀어져 가는 경향을 보였다.<br> 이러한 예술과 현실의 분리는 회화뿐 아니라 음악에서
도 나타난다. 음악에 사용되는 음은 현실의 무한한 소리 중
극히 일부이며, 일상에서 들을 수 있는 일반적 소리와 달리
균질적이고 세련되며 인위적인 배열을 따른다. 이렇게 음
악도 일상 현실과 거리를 두며 그 정체성을 확보해 왔다.<br> 그런데 이러한 예술의 흐름에 대항하여 새로운 시도를 하는
예술가들도 있었다. 화가이자 음악가였던 루솔로는 일상 현실
의 기계 소리를 소음이 아닌 음악적 표현 대상으로 삼아, 소
음 기계를 악기로 만들었다. 작곡가 바레즈는 분절된 몇 개의
음만을 표현할 수 있는 일반적 악기와 달리, 사이렌이 음과
음 사이의 분절되지 않은 무한한 음을 낼 수 있는 일상적 사
물이라는 점에 주목하여 사이렌으로 음악을 표현했다. 또한
작곡가 셰페르는 사람의 소리, 기계 소리, 자연음 등을 ‘음향
오브제’로 활용하는 ‘구체음악’을 창시하기도 하였다.<br>
 게르노트 뵈메는 예술의 영역을 일상적 삶으로 확장하려는
이러한 노력을 ‘확장된 미학’이라 일컬었다. 뵈메는 예술의
미적 경험이 일상적인 맥락에서 분리되어 예술가라는 특별한
존재에 의해 창조되는 특정한 미적 대상에만 국한된다고 보
는 기존의 미학을 비판하며, 예술이 창작되고 수용되는 미적
경험이 일상적 현실로까지 확장되어야 한다고 보았다.
`

var q10008 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go1/kor_mun_95E6MNHQ.pdf">해당모의고사다운로드</a><br>
매매 계약, 유언 등과 같은 법률행위가 법률효과를 발생시
키려면 성립요건과 효력요건을 갖추어야 한다. 성립요건은
법률행위가 성립되기 위한 요건으로, 성립요건을 갖추지 못
한 경우 법률행위가 불성립했다고 한다. 효력요건은 이미 성
립한 법률행위가 효력을 발생하는 데 필요한 요건으로, 이를
갖추어 효력을 발생시켰을 때 법률행위가 유효하다고 한다.<br> 그런데 법률행위는 성립하였지만, 효력요건이 불충분하여
그 법률행위가 성립한 당시부터 법률상 당연히 그 효력이 발
생하지 않는 경우 그 법률행위는 무효가 된다. 법률행위의
무효는 무효 사유가 존재한다면 특정인의 무효 주장이 없이
도 그 법률행위가 처음부터 효력이 없는 것이 되며, 기간이
경과해도 무효라는 사실은 변하지 않는다.<br>
 한편 법률행위의 취소는 법률행위로서 일단 효력이 발
생하였다가 어떤 사유가 있어 그 법률행위가 성립한 당시로
소급하여 효력을 잃게 되는 경우를 말한다. 법률행위의 취소가
확정되면 법률상의 효력이 무효와 같아지지만, 취소 사유가
존재하더라도 취소권을 가진 특정인이 취소를 주장할 때만
그 법률행위의 효력이 없어질 수 있다는 점에서 무효와 차이
가 있다. 또한 취소권은 일정한 기간이 경과하면 소멸되고, 취소권이 소멸된 법률행위는 결국 유효한 것으로 확정된다.
<br> 무효인 법률행위에서는 아무런 효력도 생기지 않으며, 법적
으로는 아무것도 없는 것이라 보기 때문에 소급하여 유효로
할 수 있는 대상이 없는 상태라 할 수 있다. 그래서 무효인
법률행위, 즉 무효행위는 다른 법률행위로 전환을 하기도 하
고, 추인함으로써 그때부터 새로운 법률행위가 되게 만들기도
한다. 무효는 이미 성립된 법률행위를 전제로 하기 때문에 이
러한 전환이나 추인이 가능한 것이며, 만약 법률행위가 불성
립했다면 전환이나 추인은 할 수 없다. 무효행위를 전환한다
는 것은 무효인 법률행위가 다른 법률행위로서의 효력요건은
갖추고 있을 때, 그 법률행위로서의 효력을 인정하는 것을 말
한다. 이때 전환을 위해서는 당사자가 무효임을 알았더라면, 그 법률행위가 아니라 처음부터 다른 법률행위를 했을 것이라
고 인정되어야 한다. 무효행위의 전환의 예로는, 징계해고로
서 효력요건을 갖추지 못해 무효가 된 법률행위가 징계휴직으
로서의 효력요건은 갖추고 있을 때 징계휴직으로 전환하여 법
률행위가 유효가 되는 경우를 들 수 있다.<br> 무효행위를 추인한다는 것은 무효가 된 법률행위가 갖추지
못했던 효력요건을 추후에 보충하여 새로운 법률행위로서의
효력을 인정하는 것을 말한다. 무효행위를 추인하면 그 무
효행위가 처음 성립한 때로 소급하여 유효한 것이 되는 것이
아니라 추인한 때부터 새로운 법률행위를 한 것으로 본다. 민법은 원칙적으로 무효행위의 추인을 인정하지 않지만, 무
효 원인이 소멸한 상태이고 당사자가 기존 법률행위가 무효
임을 알고 추인한 경우에 한해서는 추인을 인정하고 있다.
<br> 법률행위가 무효가 되면 그 법률행위에 따른 법률효과도
생기지 않으므로 무효행위를 근거로 하는 청구권도 부인된
다. 따라서 해당 법률행위에 따라 채무가 있는 경우 상대방
이 청구권을 행사할 수 없으므로 채무를 이행할 필요가 없
다. 만약 이미 채무가 이행된 경우라면 수령자는 해당 이득
을 반환해야 하는 부당이득 반환의무를 진다. 무효는 시간이
흘러도 그대로 유지되지만, 부당이득의 반환청구권은 소멸시
효가 있으므로 영구적으로 주장할 수 있는 것은 아니다
`
var q10009 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go1/kor_mun_95E6MNHQ.pdf">해당모의고사다운로드</a><br>
<img src="img/g1/9.png"><br>
디지털 이미지 워터마킹은 디지털 이미지에 저작권자나 배
급자의 서명, 마크 등의 특정 정보를 다른 사람들이 인식하
지 못하도록 삽입하는 것을 말한다. 이때 삽입된 정보를 디
지털 워터마크라고 하며, 이것은 디지털 이미지의 무단 배포, 무단 복사 등이 발생했을 때 저작권을 주장하거나 원본 이미
지의 훼손 여부를 검증하기 위한 수단으로 활용된다.<br> 디지털 이미지 워터마킹은 이미지의 공간 영역 활용
방식과 주파수 영역 활용 방식으로 나눌 수 있는데, 공
간 영역 활용 방식으로는 LSB(Least Significant Bit) 치
환 방법이 있다. 흑백 원본 이미지에 흑백 워터마크 이
미지를 삽입하는 과정을 통해 그 원리를 살펴보자. 흑백
이미지를 구성하는 한 픽셀*의 색상은 밝기에 따라
0~255까지의 정숫값을 가지는데 0은 검은색, 255는 흰
색을 나타낸다. 이를 컴퓨터가 처리하는 데이터의 기본
단위인 8비트*로 나타내면 각각의 픽셀은 검은색인
0 0 0 0 0 0 0 0 부터 흰색인 1 1 1 1 1 1 1 1 까지 총 256가
지의 값 중 하나를 갖게 되며, 그 숫자가 클수록 흰색에
가깝다. 이때 각 픽셀은 8비트의 데이터 중 왼쪽에 위
치하는 상위 비트가 바뀔수록 그에 해당하는 정숫값의
변화가 크기 때문에 색상의 변화를 육안으로 인식하기
쉽고, 오른쪽 하위 비트가 바뀔수록 색상의 변화를 육안
으로 인식하기 어렵다. LSB는 색상 변화에 가장 영향을
적게 주는 오른쪽 마지막 최하위 비트를 말한다. LSB 치환 과정에서는 원본 이미지에 시각적인 변화를
주지 않기 위해 워터마크 이미지의 픽셀 데이터를 원본
이미지의 각 픽셀의 LSB에 하나씩 나누어 숨긴다.<br> 이때 원본 이미지 각 픽셀의 8개의 비트 중 LSB에만
데이터를 삽입하기 때문에 워터마크 이미지의 한 픽셀
데이터를 삽입하기 위해서는 원본 이미지의 픽셀 8개가
필요하다. 결국 원본 이미지의 픽셀 수는 최대로 삽입
가능한 비트 수와 같기 때문에 원본 이미지의 픽셀 수
가 워터마크 이미지의 전체 비트 수보다 적다면 워터마
크 이미지의 데이터 일부는 삽입할 수 없게 된다. 그리
고 원본 이미지의 픽셀 수가 워터마크 이미지의 전체
비트 수보다 많을수록 원본 이미지에 시각적 변화가 적
게 나타난다. 이 방법은 많은 양의 데이터를 빠르고 간
단하게 삽입할 수 있으며, 원본 이미지의 각 픽셀에서LSB만 변경하기 때문에 시각적으로 색상이나 감도의 변
화를 감지하기 어렵다. 그러나 워터마크가 삽입된 이미지
의 LSB를 인위적으로 조작하는 경우 워터마크가 쉽게 제
거될 수 있다는 단점이 있다.<br> 주파수 영역을 활용하는 방식으로는 DCT(Discrete Cosine
Transform)를 이용하는 방법이 주로 쓰인다. DCT는 이미지
데이터를 공간값에서 주파숫값으로 바꾸는 과정이다. 이미지
에 DCT를 적용하면 주변 픽셀과 색상이나 밝기 차이가 적은
픽셀은 낮은 주파숫값으로, 경계선 등 주변 픽셀과 색상이나
밝기 차이가 큰 픽셀은 높은 주파숫값으로 나타난다. 원본
이미지를 일정한 크기의 여러 블록으로 나누고 블록별로 각
픽셀의 색상값을 DCT 수식에 따라 변환하면 주파숫값 분포
표를 얻을 수 있다. 주파숫값 분포표에는 좌측 상단으로 갈
수록 낮은 주파숫값, 우측 하단으로 갈수록 높은 주파숫값이
분포하게 되는데 이미지의 색상이나 밝기에 따라 각 주파숫
값이 분포하는 영역의 비율은 다르게 나타난다. 이때 워터마
크 이미지의 픽셀의 색상값을 주파숫값 형태로 삽입한 후 다
시 역변환 수식에 따라 변환하면, 어느 주파숫값에 삽입하든
워터마크가 원본 이미지의 전 영역에 걸쳐 고르게 분산된 형
태로 삽입된다.<br> 인간의 시각은 낮은 주파수 성분의 변화에는 민감하나 높
은 주파수 성분의 변화에는 둔감하기 때문에 높은 주파숫값
이 분포하는 영역에 워터마크를 삽입하면 원본 이미지의 시
각적인 변화를 최소화할 수 있다. 그러나 JPEG와 같은 방식
의 압축 이미지 알고리즘은 높은 주파수 성분의 요소를 제거
하여 이미지를 압축하기 때문에 높은 주파숫값이 분포하는
영역에 워터마크를 삽입하면 이미지 압축과 같은 과정에서
워터마크가 삭제될 수 있다. 그래서 워터마크를 삽입할 때는
낮은 주파숫값이 분포하는 영역과 높은 주파숫값이 분포하는
영역의 경계면에 해당하는 특정 주파숫값 영역을 중심으로
워터마크 정보를 삽입한다.
<br> 이 방법은 이미지의 왜곡이 적어 시각적으로 원본 이미지와
의 차이를 식별하기 어렵다. 또한 삽입할 데이터를 이미지
영역에 골고루 분산시키기 때문에 변형의 과정을 거쳐도
LSB 치환 방법에 비해 워터마크가 상대적으로 쉽게 제거되
지 않는다. 그러나 데이터 삽입이 가능한 주파숫값의 개수가
원본 이미지의 픽셀 수보다는 훨씬 적기 때문에, 삽입할 수
있는 데이터의 양이 LSB 치환 방법보다 상대적으로 적다. 그
리고 픽셀의 개수가 같은 이미지라 하더라도 이미지의 색상
이나 밝기에 따라 각 주파숫값이 분포하는 영역의 비율이 달
라지기 때문에 이미지에 따라 삽입할 수 있는 데이터의 양이
달라질 수 있다.<br><br> * 픽셀 : 작은 점의 행과 열로 이루어져 있는 화면의 작은 점 각각을 이르는 말.<br> * 비트 : 2진 기수법 표기의 기본 단위. 2진 기수법에서는 모든 수를 0과 1로만
표기하는데 이 0 또는 1이 각각 하나의 비트가 된다. 
`
var q10012 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go1/kor_mun_M4SXZ2R4.pdf">해당모의고사다운로드</a><br>
상담 이론이자 상담 기법인 ‘현실요법’에서는 인간의 다섯 가
지 기본 욕구를 제시하고 있다. 이 이론에서는 개인의 모든 행동
은 기본 욕구를 충족시키기 위해서 그 자신이 선택하는 것이라 
보았다. 만약 이러한 선택으로 문제가 발생한다면 다섯 가지 기
본 욕구를 실현 가능한 수준으로 타협하고 조절해 새로운 선택
을 할 필요가 있다고 ⓐ제안했다.<br> 다섯 가지 기본 욕구 중 첫째는 ‘생존의 욕구’로, 자신의 삶을 
유지하려는 생물학적인 속성이다. 사회적 규칙이나 상식을 지키
려는 욕구이며, 생존에 필요한 것을 아끼고 모으려는 욕구이기도 
하다. 이 욕구가 강한 사람은 건강과 안전을 중시하는 편이다. 둘째는 ‘사랑의 욕구’로, 사랑하고 나누며 함께하고자 하는 욕구
이다. 이 욕구가 강한 사람은 타인을 잘 돕고, 사랑을 주는 만큼 
받는 것도 중요하게 여기기에 인간관계에서 힘들어하기도 한다. 셋째는 ‘힘의 욕구’로, 경쟁하여 성취하고 인정받고 싶어 하는 욕
구이다. 이 욕구가 강한 사람은 직장에서의 성공과 명예를 중시
하고 높은 사회적 지위에 ⓑ도달하기 위해 노력한다. 또한 자기
가 옳게 여기는 것에 대한 의지가 있어 자기주장이 강하며 타인
에게 지시하는 일에 능하다. 넷째는 ‘자유의 욕구’로, 무언가에 
얽매이지 않고 벗어나고 싶어 하는 욕구이다. 이 욕구가 강한 사
람은 상대방을 구속하는 것, 자신을 구속시키는 것을 싫어한다. 그래서 상대방에게 대체로 관대하고, 혼자 하는 것을 좋아하며, 사람들과 적정한 거리를 유지하는 것을 편하게 여긴다. 다섯째는 
‘즐거움의 욕구’로, 새로운 것을 배우고 놀이를 통해 즐기고 싶어 
하는 욕구이다. 이 욕구가 강한 사람은 취미 생활을 즐기며, 잘 
웃고 긍정적 태도를 취한다. 또한 호기심이 많기에 배우는 것을 
좋아한다.<br> 현실요법에서는 이 다섯 가지 욕구들의 강도가 개인마다 달라 
행동 양상이 다양하게 나타나고, 여러 가지 갈등을 겪을 수도 있
다고 보았다. 현실요법은 우선 내담자*가 자신의 욕구를 들여다
볼 수 있도록 한 다음, 약한 욕구를 북돋아 주거나 강한 욕구들 
사이에서 타협과 조절을 하여 새로운 선택을 하도록 이끄는 단
계를 밟는다. 예를 들어 사랑의 욕구가 강하고 힘의 욕구가 약한 
사람이 타인의 부탁에 불편함을 느끼면서도 거절하지 못해 괴로
워한다고 가정해 보자. 이 경우 현실요법에서는 ㉠힘의 욕구를 
북돋아 자기주장을 표현할 수 있도록 도울 수 있다. 또 자유의 
욕구와 힘의 욕구 모두가 강한 사람은 자신이 ⓒ선호하는 것을 
우선시하고 이것이 방해받으면 불편해하며 주변 사람들과 갈등
을 일으킬 수 있다. 이 경우 힘의 욕구를 조절하도록 이끌 수 있
는데, 타인과의 사소한 의견 충돌 상황에서 자기주장을 강조하기
보다는 타인의 마음을 헤아리고 그 의견을 ⓓ겸허하게 수용하는 
연습을 하게 할 수 있다.<br> 현실요법은 타인의 욕구 충족을 방해하지 않으면서 효과적인 
선택을 통해 자신의 욕구를 충족시키려 한다. 이는 내담자가 외
부 요인에 의해 통제되는 존재가 아니라 스스로 자신의 욕구를 
조절할 수 있는 주체라고 보는 관점을 기반으로 한다. 현재 현실
요법은 상담 분야에서 호응을 얻어 심리 상담에 널리 ⓔ활용되
고 있다.<br> * 내담자 : 상담실 따위에 자발적으로 찾아와서 이야기하는 사람.
`
var q10013 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go1/kor_mun_M4SXZ2R4.pdf">해당모의고사다운로드</a><br>
<img src="img/g1/13.png"><br>
<img src="img/g1/13-1.png"><br>
물이 담긴 욕조의 마개를 빼면 물이 배수구 주변에서 회전하
며 소용돌이를 일으킨다. 배수구에서 멀리 떨어져 있으면 빨려 
들어가는 속도의 크기가 0에 가깝고, 배수구 중앙에 가까울수록 
속도가 빨라진다. 원운동을 하는 물체의 이동 거리, 즉 호의 길
이가 시간에 따라 변하는 비율을 원주속도라고 한다. 욕조의 소
용돌이 중심과 가장 가까운 부분에서 최대 원주속도가 나오고, 소용돌이 중심에서 멀어져 반지름이 커짐에 따라 원주속도가 감
소한다. 이 소용돌이를 ‘자유 소용돌이’라 하는데, 배수구로 들어
간 물은 물체의 자유낙하처럼 중력의 영향 아래 물 자체의 에너
지로 운동을 유지한다.<br> 이와 달리 컵 속의 물을 숟가락으로 강하게 휘젓거나 컵의 중
심선을 회전축으로 하여 컵과 물을 함께 회전시키는 상황을 생
각해 보자. 이때 원심력 등이 작용해 중심의 물 입자들이 컵 가
장자리로 쏠려 컵 중앙에 있는 물의 압력이 낮아지면서 ㉠ 가운
데가 오목한 소용돌이가 만들어진다. 회전이 충분히 안정되면 
물 전체의 회전 속도, 즉 회전하는 물체의 단위 시간당 각도 변
화 비율인 ㉡각속도가 똑같아져 마치 팽이가 돌듯이 물 전체가 
고체처럼 회전한다. 이때 물은 팽이의 회전과 같이 회전 중심은 
원주속도가 0이 되고 중심에서 멀어질수록 반지름에 비례하여 
원주속도가 증가하는 분포를 보인다. 이 소용돌이를 ‘강제 소용
돌이’라 하는데, 용기 안의 물이 회전 운동을 유지하려면 에너지
를 외부에서 인위적으로 제공해야 한다.<br> 숟가락으로 컵 안에 강제 소용돌이
를 만든 후 숟가락을 빼고 일정한 시
간 동안 관찰하면 가운데에는 강제 
소용돌이, 주변에는 자유 소용돌이가 
발생한다. <그림>에서 보는 것처럼 
이를 ‘랭킨의 조합 소용돌이’라고 한
다. 이는 전체를 강제로 회전시킨 힘
을 제거했을 때 바깥쪽에서는 원주속
도가 서서히 떨어지고, 중심에서는 원주속도가 유지되는 상태의 
소용돌이다. 조합 소용돌이에서는 소용돌이 중심에서 원주속도가 
최소가 되고, 강제 소용돌이에서 자유 소용돌이로 전환되는 점
에서 원주속도가 최대가 된다. 조합 소용돌이의 예로 ㉢태풍의 
소용돌이를 들 수 있다.<br> 이러한 원리를 적용한 분체 분리기는 기체나 액체의 흐름으로 
분진 등 혼합물을 분리하는 장치이다. 혼합물에 작용하는 원심
력도 이용하기 때문에 원심 분리기, 공기의 흐름이 기상 현상의 
사이클론과 비슷해서 사이클론 분리기라고도 한다. 그 예로 쓰
레기용 필터가 없는 가정용, 산업용 ㉣ 사이클론식 청소기를 들 
수 있다. 원통 아래에 원추 모양의 통을 붙이고 원추 아래에 혼
합물 상자를 두는데, 내부 중앙에는 별도의 작은 원통인 내통이 
있다. 혼합물을 함유한 공기를 원통부 가장자리를 따라 소용돌
이를 만들어 시계 방향으로 흘려보내면, 혼합물은 원통부와 원
추부 벽면에 충돌하여 떨어져 바닥에 쌓인다. 유입된 공기는 아
래쪽 원추부로 향할수록 원주속도를 증가시키는 자유 소용돌이
를 만들고, 원추부 아래쪽에서는 강해진 자유 소용돌이가 돌면
서 강제 소용돌이를 만들어 낸다. 강제 소용돌이는 용기 중앙의 
내통에서 혼합물이 없는 공기로 흐르게 되어 반시계 방향으로 
돌며 배기된다.
`
var q10019 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go1/kor_mun_M4SXZ2R4.pdf">해당모의고사다운로드</a><br>
<img src="img/g1/19.png"><br>
<img src="img/g1/19-1.png"><br>
어떤 안건을 대하는 집단 구성원들의 생각은 각기 다르므로, 상이한 생각들을 집단적 합의에 이르게 하는 의사 결정 과정이 
필요하다. 공공 선택 이론은 이처럼 집단을 구성하는 개인의 
의사가 집단의 의사로 통합되는 과정을 다룬다. 직접 민주주의
하에서의 의사 결정 방법으로 단순 과반수제, 최적 다수결제, 점수 투표제, 보르다(Borda) 투표제 등이 있다.<br> ㉠ 단순 과반수제는 투표자의 과반수가 지지하는 안건이 채
택되는 다수결 제도이다. 효율적으로 의사 결정이 이루어져 많
이 사용되고 있으나, 각 투표자는 찬반 여부를 표시할 뿐 투표 
결과에는 선호 강도가 드러나지 않아 안건 채택 시 사회 전체
의 후생*이 감소할 가능성이 있다. 이는 다수의 횡포에 의해 소
수의 이익이 침해되는 상황이 발생할 수 있음을 의미한다. 또
한 어떤 대안들을 먼저 비교하는가에 따라 그 결과가 달라지는 
ⓐ ‘투표의 역설’ 현상이 나타날 수 있다. 예를 들어, 갑, 을, 병 
세 사람이 사는 마을에 정부에서 병원, 학교, 경찰서 중 하나를 
지어 줄 테니 투표를 통해 선택하라고 제안하였고, 이때 세 사
람의 선호 순위가 다음 <표>와 같다고 하자. 세 가지 대안을 
동시에 투표에 부치면 하나의 대안으로 결정되지 않는다. 그래
서 먼저 병원, 학교, 경찰서 중 두 대안을 선정하여 다수결로 
결정한 후 남은 한 가
지 대안과 다수결로 승
자를 결정하면 최종적
으로 하나의 대안이 결
정된다. 즉, 비교하는 대
안의 순서에 따라 <표>
의 투표 결과는 달라지
게 된다.<br> 최적 다수결제는 투표에 따르는 총비용이 최소화되는 지
점을 산정한 후, 안건의 찬성자 수가 그 이상이 될 때 안
건이 통과되는 제도이다. 이때의 총비용은 의사 결정 비용
과 외부 비용의 합으로 결정된다. 의사 결정 비용은 투표
자들의 동의를 구하는 데 드는 시간과 노력에 따른 비용을 
의미하며, 찬성표의 비율이 높을수록 증가한다. 외부 비용
은 어떤 안건이 통과됨에 따라 그 안건에 반대하였던 사람
들이 느끼는 부담을 의미하며, 찬성표의 비율이 높아질수
록 낮아지며 모든 사람이 찬성할 경우에는 0이 된다. 안건 
통과에 필요한 투표자 수가 증가할수록 의사 결정 비용이 
증가하므로 의사 결정 비용 곡선은 우상향한다. 이와 달리 
외부 비용은 감소하므로 외부 비용 곡선은 우하향하며, 두 
곡선을 합한 총비용 곡선은 U자 형태로 나타난다. 이때 총
비용이 최소화되는 곳이 최적 다수결제에서의 안건 통과의 
기준이 되는 최적 다수 지점이 된다. 이 제도는 의사 결정 
과정을 이론적으로 명쾌하게 설명할 수 있지만, 최적 다수
결의 기준을 정하는 데 시간을 지나치게 소비하게 된다는 
단점이 있다.<br> ㉡ 점수 투표제는 각 투표자에게 일정한 점수를 주고 각 투
표자가 자신의 선호에 따라 각 대안에 대하여 주어진 점수를 
배분하여 투표하는 제도로, 합산하여 가장 많은 점수를 얻은 
대안이 선택된다. 투표자의 선호 강도에 따라 점수를 배분하므
로 투표자의 선호 강도가 잘 반영된다. 소수의 의견도 투표 결
과에 잘 반영되며, 투표의 역설이 나타나지 않는다는 장점이 
있다. 하지만 전략적 행동에 취약하여 투표 결과가 불규칙하게 
바뀔 수 있다는 단점이 있다. 전략적 행위란 어떤 투표자가 다
른 투표자의 투표 성향을 예측하고 자신의 행동을 이에 맞춰 
변화시킴으로써 자기가 원하는 것을 얻으려 하는 태도를 뜻한
다. 이 행위는 어떤 투표 제도에서든 나타날 수 있으나, 점수 
투표제에서 나타날 가능성이 높다.<br> ㉢ 보르다 투표제는 n개의 대안이 있을 때 가장 선호하는 대
안부터 순서대로 n, (n-1), …, 1점을 주고, 합산하여 가장 높
은 점수를 받은 대안을 선택하는 투표 방식으로, 점수 투표제
와 달리 오로지 순서에 의해서만 선호 강도를 표시한다. 이 제
도하에서는 일부에게 선호도가 아주 높은 대안보다는 투표자 
모두에게 어느 정도 차선이 될 수 있는 ⓑ 중도의 대안이 채택
될 가능성이 높으며, 점수 투표제와 마찬가지로 투표의 역설이 
발생하지 않는다.<br><br> * 후생 : 사회 구성원들의 복지 수준.<br><br>

<table>
<tr>
<td> </td>
<td>갑</td>
<td>을</td>
<td>병</td>
</tr>
<tr>
<td>1순위</td>
<td>병원</td>
<td>학교</td>
<td></td>
</tr>
<tr>
<td>2순위</td>
<td>학교</td>
<td>경찰서</td>
<td>병원</td>
</tr>
<tr>
<td>3순위</td>
<td>경찰서</td>
<td>병원</td>
<td>학교</td>
</tr>
</table>
`
var q10024 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230323/go1/kor_mun_924AG6DU_1.pdf">해당모의고사다운로드</a><br>
경기가 침체되어 가계의 소비가 줄어들면 시중의 제품이 팔
리지 않아 기업은 생산 규모를 축소하게 된다. 그 결과 실업률
이 증가하고 가계의 수입이 감소하면서 소비는 더욱 위축된다. 이와 같은 악순환으로 경기 침체가 심화되면 국가는 이에서 
벗어나기 위해 유동성을 늘리는 통화 정책을 시행한다.<br> 유동성이란 자산 또는 채권을 손실 없이 현금화할 수 있는 
정도로, 현금과 같은 화폐는 유동성이 높은 자산인 반면 토지
나 건물과 같은 부동산은 유동성이 낮은 자산이다. 이처럼 유
동성은 자산의 성격을 나타내는 용어이지만, 흔히 시중에 유통
되는 화폐의 양, 즉 통화량을 나타내는 말로도 사용된다. 가령 
시중에 통화량이 지나치게 많을 때 ‘유동성이 넘쳐 난다’고 표
현하고, 반대로 통화량이 줄어들 때 ‘유동성이 감소한다’고 표
현한다. 유동성이 넘쳐 날 경우 시중에 화폐가 흔해지는 상황
이므로 화폐의 가치는 떨어지게 된다.<br> 유동성은 금리와 밀접한 관련이 있기 때문에 국가는 정책적
으로 금리를 올리고 내림으로써 유동성을 조절할 수 있다. 이
때 금리는 예금이나 빌려준 돈에 붙는 이자율로, 이는 기준 금
리와 시중 금리 등으로 구분된다. 기준 금리는 국가가 정책적
인 차원에서 결정하는 금리로, 한 나라의 금융 및 통화 정책의 
주체인 중앙은행에 의해 결정된다. 반면 시중 금리는 기준 금
리의 영향을 받아 중앙은행 이외의 시중 은행이 세우는 표준
적인 금리로, 가계나 기업의 금융 거래에 영향을 미친다. 가령 
시중 금리가 내려가면 예금을 통한 이자 수익과 대출에 따른 
이자 부담이 줄어 가계나 기업에서는 예금을 인출하거나 대출
을 받으려는 경향성이 늘어난다. 그 결과 시중의 유동성이 증
가하게 된다. 반대로 시중 금리가 올라가면 이자 수익과 대출 
이자 부담이 모두 늘어나기 때문에 유동성이 감소하게 된다.<br> 이와 같은 금리와 유동성의 관계를 고려하여, 중앙은행은 기
준 금리를 조절하는 통화 정책을 통해 경기를 안정시키려고 
한다. 만일 경기가 침체되면 중앙은행은 기준 금리를 인하하는 
정책을 도입하여 시중 금리를 낮추도록 유도한다. 그 결과 유
동성이 증가하여 가계의 소비가 늘고 주식이나 부동산에 대한 
투자가 확대된다. 또한 기업의 생산과 고용이 늘고 다양한 분
야에 대한 투자가 확대되어 물가가 상승하고 경기가 전반적으
로 활성화된다. 반대로 경기가 과열되어 자산 가격이나 물가가 
지나치게 오르면 중앙은행은 기준 금리를 인상하는 정책을 통
해 유동성을 감소시킨다. 그 결과 기준 금리를 인하할 때와 반
대의 현상이 나타나 자산 가격이 하락하고 물가가 안정되어 
과열된 경기가 진정된다.<br> 그러나 중앙은행이 경기 활성화를 위해 통화 정책을 시행했
음에도 불구하고 애초에 의도한 결과가 나타나지 않기도 한다. 즉, 기준 금리를 인하하여 시중에 유동성을 충분히 공급하더라
도, 증가한 유동성이 기대만큼 소비나 투자로 이어지지 않으면 
경기가 활성화되지 않는다. 특히 심각한 경기 침체로 인해 경
기 회복에 대한 전망이 불투명할 경우, 경제 주체들은 쉽게 소
비를 늘리지 못하거나 투자를 결정하지 못해 돈을 손에 쥐고
만 있게 된다. 이 경우 충분한 유동성이 경기 회복으로 이어지
지 못해 경기 침체가 지속되는데, 마치 유동성이 함정에 빠진 
것 같다고 하여 케인스는 이를 유동성 함정 이라 불렀다. 그는 
이러한 유동성 함정을 통해 통화 정책의 한계를 설명하면서, 정부가 재정 지출을 확대하여 소비와 투자를 유도하는 정책을 
시행하는 것이 중요하다고 역설하였다
`
var q10027 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230323/go1/kor_mun_924AG6DU_1.pdf">해당모의고사다운로드</a><br>
<img src="img/g1/27.png"><br>
19세기에 분트는 인간의 정신세계가 의식으로 이루어져 있
다고 보고, 실험을 통해 인간의 정신 현상과 행동을 설명하는 
실험심리학을 주창하였다. 이때 의식이란 깨어 있는 상태에서 
자신이나 세계를 인식하는 모든 정신 작용을 의미한다. 그러나 
프로이트는 정신 질환을 겪는 환자들을 치료하면서 인간에게 
의식과는 다른 무의식 세계가 있다는 것을 발견하였다. 이에 
그는 인간을 무의식의 지배를 받는 비합리적 존재로 간주하고, 정신분석이론을 통해 인간의 정신세계를 ⓐ 규명하려 하였다.<br> 프로이트에 의하면 인간의 정신세계 중 의식이 차지하는 영
역은 빙산의 일각일 뿐, 무의식이 
정신세계의 대부분을 차지한다. 그
는 무의식의 심연에는 ‘원초아’가, 무의식에서 의식에 걸쳐 ‘자아’와 
‘초자아’가 존재한다고 보았다. 원
초아는 성적 에너지를 바탕으로 본
능적인 욕구를 충족하려는 선천적 
정신 요소이다. 반면 자아는 외적 상황으로 인해 충족되지 못
하고 지연되거나 좌절된 원초아의 욕구를 사회적으로 용인될 
수 있는 방법으로 충족하려는 정신 요소이다. 마지막으로 초자
아는 도덕률에 따라 원초아의 욕구를 억제하고 양심에 따라 
행동하도록 하는 정신 요소로, 어린 시절 부모의 종교나 가치
관 등을 내재화하는 과정에서 후천적으로 발달한다.<br> 이러한 원초아, 자아, 초자아는 역동적으로 상호작용하면서 
개인의 성격을 형성한다. 가령, 원초아가 강할 때는 본능적인 
욕구에 집착하는 충동적인 성격이, 초자아가 강할 때는 엄격하
게 도덕을 지키려는 원칙주의적 성격이 나타난다. 자아는 원초
아와 초자아의 요구 사이에서 이를 조정하는 역할을 하기 때
문에, 정신적 균형을 이루기 위해서는 자아의 발달이 중요하
다. 만일 자아가 제 역할을 하지 못하면 정신 요소의 균형이 
깨져 불안감이 생기는데, 자아는 이를 해소하기 위해 무의식적
으로 방어기제를 사용하게 된다. 대표적인 방어기제로는 억압
이나 승화 등이 있다. 억압은 자아가 수용하기 힘든 욕구를 무
의식 속으로 억누르는 것을, 승화는 그러한 욕구를 예술과 같
이 가치 있는 활동으로 ⓑ 전환하는 것을 의미한다. 개인마다 
습관적으로 사용하는 방어기제가 다르기 때문에 어떤 방어기
제를 사용하느냐 또한 개인의 성격 형성에 영향을 미친다.<br> 프로이트는 어린 시절에 해소되지 않은 원초아의 욕구나 정
신 요소 간의 갈등은 성인이 된 후에도 지속적으로 영향을 주
기 때문에, 이 시기에 부모와의 상호작용 경험이 성격 형성에 
큰 영향을 준다고 설명하였다. 특히 그는 성인의 정신 질환을 
어린 시절의 심리적 갈등이 재현된 것으로 보고, 이를 치유하
기 위해서는 무의식에 내재되어 있는 과거의 상처를 의식의 
세계로 끌어내는 과정이 필요하다고 주장하였다. 이러한 프로
이트의 이론은 기존의 이론에서 ⓒ 간과한 무의식에 대한 탐구
를 통해 인간 이해에 대한 지평을 넓혔다는 평을 받고 있다. 
`
var q10028 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230323/go1/kor_mun_924AG6DU_1.pdf">해당모의고사다운로드</a><br>
<img src="img/g1/28.png"><br>
융은 프로이트의 정신분석이론에 반기를 들고, 분석심리학
을 주창하였다. 무의식을 단지 의식에서 수용할 수 없는 원초
적 욕구나 해결되지 못한 갈등의 창고로만 본 프로이트와 달
리, 융은 무의식을 인간이 잠재적 가능성을 실현할 때 필요한 
창조적인 에너지의 샘으로 보았다는 점에서, 그의 분석심리학
은 프로이트의 이론과 구별된다.<br> 융은 정신세계의 가장 바깥쪽
에는 의식이, 그 안쪽에는 개인 
무의식이, 그리고 맨 안쪽에는 
집단 무의식이 순서대로 자리 
잡고 있다고 보았다. 의식은 생
각이나 감정, 기억과 같이 인간
이 직접 인식할 수 있는 영역으로, 여기에는 ‘자아’가 존재한
다. 자아는 의식을 지배하는 동시에 무의식과 교류하며 이를 
조정하는 역할을 한다. 개인 무의식은 의식에 의해 ⓓ 배제된 
생각이나 감정, 기억 등이 존재하는 영역이다. 이곳에 존재하
는 ‘그림자’는 자아에 의해 억압된 ‘또 하나의 나’라고 할 수 
있다. 마지막으로 집단 무의식은 태어날 때부터 누구나 가지고 
있는 원초적이며 보편적인 무의식이다. 거기에는 진화를 통해 
축적되어 온 인류의 경험이 ‘원형’의 형태로 존재한다. 가령 
어두운 상황에서 누구나 공포심을 느끼는 것이 원형에 해당한
다.<br>융에 따르면 집단 무의식의 가장 안쪽에는 ‘자기’가 존재한
다. 이는 정신세계에 내재하는 개인의 근원적인 모습이라고 할 
수 있다. 융은 자아가 성찰을 통해 무의식의 심연에 존재하는 
자기를 발견하면, 인간은 비로소 타인과 구별되는 고유한 존재
가 된다고 보고 이를 개별화라고 불렀다. 이는 의식에 존재하
는 자아가 무의식과 끊임없이 상호작용하며 무의식의 영역을 
의식으로 통합하는 과정, 즉 ㉠ 무의식을 의식화하는 과정을 
통해 이루어진다. 이 과정에서 자아는 자신의 또 다른 모습인 
그림자와 ⓔ 대면하게 되고, 집단 무의식에 존재하는 여러 원
형들을 발견하게 된다. 결국 자아가 무의식의 심연에 존재하는 
자기를 찾아가는 과정은 정신세계를 구성하는 자아와 그림자, 그리고 여러 원형들이 대립에서 벗어나 하나의 정신으로 통합
되면서 정신적 균형을 이루는 과정이라 할 수 있다. 이러한 과
정에서 개인은 내면의 성숙을 이루며 자신의 정체성을 찾게 
된다.
`
var q10030 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230323/go1/kor_mun_924AG6DU_1.pdf">해당모의고사다운로드</a><br>
<img src="img/g1/30.png"><br>
<img src="img/g1/30-1.png"><br>
맑고 화창한 날 밖에서 스마트폰 화면이 잘 보이지 않았던 
경험이 한 번쯤은 있을 것이다. 이는 화면에 반사된 햇빛이 화
면에서 나오는 빛과 많이 ⓐ 혼재될수록 야외 시인성이 저하되
기 때문이다. 야외 시인성이란, 빛이 밝은 야외에서 대상을 명
확하게 인식할 수 있는 성질을 의미한다. 그렇다면 스마트폰에
는 야외 시인성 개선을 위해 어떠한 기술이 적용되어 있을까?
<br>㉠ 스마트폰 화면의 명암비가 높으면 우리는 화면에 표현된 
이미지를 선명하다고 인식한다. 명암비는 가장 밝은 색과 가장 
어두운 색을 화면이 얼마나 잘 표현하는지를 나타내는 수치로, 흰색을 표현할 때의 휘도를 검은색을 표현할 때의 휘도로 나
눈 값이다. 여기서 휘도는 화면에서 나오는 빛이 사람의 눈에 
얼마나 들어오는지를 나타내는 양이다. 가령, 흰색을 표현할 
때의 휘도가 2,000 cd/m
2이고 검은색을 표현할 때의 휘도가 
2 cd/m
2인 스마트폰의 명암비는 1,000이다.<br> 명암비는 휘도를 측정하는 환경에 따라 암실 명암비와 명실 
명암비로 구분된다. 암실 명암비는 햇빛과 같은 외부광 없이 
오로지 화면에서 나오는 빛만을 인식할 수 있는 조건에서의 
명암비를, 명실 명암비는 외부광이 ⓑ 존재하는 조건에서의 명
암비를 의미한다. 스마트폰의 야외 시인성을 높이기 위해서는 
명실 명암비를 높여야 한다. 이를 위해 화면에서 흰색을 표현
할 때의 휘도를 높이는 방법과 검은색을 표현할 때의 휘도를 
낮추는 방법을 사용할 수 있다.<br> 그런데 스마트폰에 흔히 사용되는 OLED는 흰색을 표현할 
때의 휘도를 높이는 데 한계가 있다. OLED는 화면의 내부에 
있는 기판*에서 빛을 내는 소자로, 빨간색, 초록색, 파란색 빛
을 조합하여 다양한 색을 ⓒ 구현한다. 이렇게 OLED가 색을 
표현할 때, 출력되는 빛의 세기를 높이면 해당 색의 휘도가 높
아진다. 그러나 강한 세기의 빛을 출력할수록 OLED의 수명이 
ⓓ 단축되는 문제가 있다. 이러한 이유로 OLED 스마트폰에는 
편광판과 위상지연필름을 활용하여, 외부광의 반사로 높아진, 검은색을 표현할 때의 휘도를 낮추는 기술이 적용되고 있다.<br> <그림>은 OLED 스마트폰에 적용된 편광판의 원리를 나타
낸 것이다. 일반적으로 빛은 진
행하는 방향에 수직인 모든 방
향으로 진동하며 나아간다. 빛
이 편광판을 통과하면 그중 편
광판의 투과축과 평행한 방향으
로 진동하며 나아가는 선형 편
광만 남고, 투과축의 수직 방향
으로 진동하는 빛은 차단된다. 이러한 과정에서 편광판을 통과
한 빛의 세기는 감소하게 된다.<br> 이러한 원리를 이용해 OLED 스마트폰에서 야외 시인성
을 높이는 기술을 설명하면 다음과 같다. 먼저 스마트폰 화
면 안으로 들어오는 외부광은 편광판을 거치면서 일부가 
차단되고 투과축과 평행한 방향으로 진동하는 선형 편광만 
남게 된다. 그런 다음 이 선형 편광은 위상지연필름을 지나
면서 회전하며 나아가는 빛인 원형 편광으로 편광의 형태
가 바뀐다. 이 원형 편광은 스마트폰 화면의 내부 기판에 
반사된 뒤, 다시 위상지연필름을 통과하며 선형 편광으로 
바뀐다. 그런데 이 선형 편광의 진동 방향은 외부광이 처음 
편광판을 통과했을 때 남은 선형 편광의 진동 방향과 수직
을 이루게 되어 편광판에 가로막히게 된다. 그 결과 기판에 
반사된 외부광은 화면 밖으로 빠져나가지 못하게 된다.
<br>이와 같은 기술은 OLED 스마트폰의 야외 시인성을 높이는 
데에는 매우 효과적이지만, 편광판을 사용할 수밖에 없기 때문
에 스마트폰 화면이 일정 수준의 명암비를 유지하기 위해서는 
㉡ OLED가 내는 빛의 세기를 높게 유지해야 한다는 단점이 
존재한다. 그리고 외부광이 화면의 외부 표면에 반사되어 나타
나는 야외 시인성의 저하도 ⓔ 방지하지 못한다. 최근에는 이
러한 문제점들을 개선하기 위한 연구가 다양한 분야에서 이루
어지고 있다.<br><br> * 기판 : 전기 회로가 편성되어 있는 판.
`
// var q20032 = `<a href="">해당모의고사바로가기</a><br><img src="img/g2/.png"><br>`

var q20001 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go2/kor_mun_P5SP1P3D.pdf">해당모의고사다운로드</a><br>
<img src="img/g2/1.png"><br>
미국의 헌법학자 제롬 배런은 1967년 언론 매체 접근 · 이
용권을 최초로 주장하였다. 언론 매체 접근 · 이용권이란 국민
이 자신의 사상이나 의견을 표명하기 위하여 언론 매체에 자
유로이 접근하여 이를 이용할 수 있는 권리를 말한다.<br> 배런은 당시 미국과 영국 내 언론의 독과점으로 인해 국민
의 다양한 의견을 표출할 수 있는 통로가 점점 사라지고 있
음을 지적했다. 또한 그는 상업적 이익만을 추구하는 언론사
가 보다 많은 시청자나 독자 등을 확보하기 위하여 사람들이 
불편하게 여기는 주장이나 의견보다는 대중적인 주장이나 의
견만을 전달하고 있다고 비판하였다. 언론 매체가 공론장의 
역할을 하지 못해 국민의 다양하고 공정한 여론을 형성하는 
기능을 수행하지 못함을 지적한 것이다. 이러한 상황에서 국
민들이 언론 매체가 아닌 다른 수단을 통해 자신의 의견을 
표명하려고 해도 매스미디어에 ⓐ 견주면 그 전달 범위가 극
히 제한적이라고 보았다. 매스미디어의 거대화, 독점화에 따
라 언론의 자유가 매체를 소유하거나 지배하는 소수의 계층
이나 집단의 것으로 전락하였기 때문에 시민들의 언론의 자
유를 보장하기 위해 언론 매체 접근 · 이용권을 인정해야 함
을 주장한 것이다.<br> 법적으로 보장받는 언론 매체 접근 · 이용권의 대표적인 형
태는 반론권이다. 이는 언론 매체에 의하여 명예 훼손 · 비판 · 공격 등으로 피해를 입은 국민이 자기와 관련이 있는 보도에 
대해 반론이나 정정 또는 해명의 기회를 요구할 수 있는 권
리이다. 반론권은 언론 매체에 정정 및 반론 보도, 추후 보도 
등을 청구할 수 있는 권리로 구체화되어 있다. 반론권 이외
에도 방송법에 언론 매체가 사회의 다양성을 해치거나 임의
로 특정 의견을 차별하지 못하게 하는 조항을 마련하고 있으
며, 시청자 참여 프로그램을 편성하도록 하는 조항 등을 통
해 국민이 언론 매체를 이용하여 자신의 의사를 표명할 수 
있도록 하고 있다.<br> 언론 매체 접근 · 이용권은 국민의 언론의 자유를 보장하고 
민주주의 실현에 ⓑ 이바지하는 중요한 권리이다. 그러나 언
론 매체 접근 · 이용권은 언론 매체가 신문 등의 표현 내용을 
결정하는 권리인 편집권과 ⓒ 맞부딪칠 수도 있다. 이에 언론 
매체에 일정한 기준의 재량권을 부여하고, 만약 언론 매체가 
일정한 재량권을 일탈하거나 남용할 때는 구제 수단을 활용
하여 국민의 언론 매체 접근 · 이용권을 보호하고 있다. 

`
var q20002 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go2/kor_mun_P5SP1P3D.pdf">해당모의고사다운로드</a><br>
<img src="img/g2/2.png"><br>
언론 보도에 의해 명예나 권리를 침해받은 때에는 어떻게 
해야 할까? 명예 훼손죄로 고소할 수도 있지만, 판결이 나오
기까지 시간이 오래 걸린다. 따라서 언론중재법에는 언론 매
체에 의해 피해를 받은 개인에게 신속하고 대등한 방어 수단
을 제공하기 위해 정정 보도 청구권과 반론 보도 청구권이 
규정되어 있다.<br> 정정 보도 청구권은 진실하지 않은 언론 보도 등으로 인해 
피해를 입었을 경우 보도 내용의 잘못을 바로잡는 정정 보도
를 요구할 수 있는 권리이며, 반론 보도 청구권은 언론 보도 
등으로 인해 피해를 입었을 경우 그 보도 내용에 관한 반론을 
보도해 줄 것을 요구할 수 있는 권리이다. 정정 보도를 청구
하는 피해자는 원 보도가 허위임을 입증해야 한다. 반면 반론 
보도는 원 보도의 진위 여부와 상관없이 청구할 수 있다.<br> 정정 보도 청구권과 반론 보도 청구권의 주체는 보도 내용
과 개별적 연관성이 있으며 그 보도로 인해 피해를 입은 자이
다. 청구권의 주체는 언론 보도의 ‘사실적 주장’에 대해 정정 
보도와 반론 보도를 청구할 수 있는데, ‘사실적 주장’이라는 
것은 증거에 의해서 그 존재 여부를 판단할 수 있는 사실 관
계에 관한 주장을 의미한다. 따라서 단순한 의견이나 논평, 광고 등은 청구의 대상이 아니다. 피해자는 해당 언론 보도 
등이 있음을 안 날로부터 3개월 이내에 정정 또는 반론 보도
를 청구할 수 있는데, 해당 언론 보도 등이 있은 후 6개월이 
지났을 때에는 이를 청구할 수 없다. 정정 또는 반론 보도 청
구는 언론사 등의 대표자에게 서면으로 하여야 하며, 언론사
가 청구를 수용한다면 청구를 받은 날부터 7일 이내에 정정 
또는 반론 보도문을 방송하거나 ⓓ 싣게 된다. ㉠ 이때의 보도
는 원 보도와 동일한 채널, 지면에서 이루어져야 하며, 방송 
진행자는 보도문을 읽을 때 통상적인 속도로 읽어야 한다.<br> 만약 언론중재법상 정정 보도를 청구할 수 있는 기간이 지
났다면 민법 제764조에 의거하여 정정 보도를 청구할 수도 
있다. 민법상 정정 보도 청구권에 따르면 언론 보도 등으로 
명예를 훼손당한 사람은 언론 보도가 있음을 안 날로부터 3
년 이내에 법원에 소를 제기할 수 있는데, 해당 언론 보도가 
있은 후 10년이 지났을 때에는 불가하다. 민법상 정정 보도
를 청구할 때는 언론사 등의 대표자뿐만이 아니라, 잘못된 
언론 보도로 손해를 가한 기자, 편집자 등에 대해서도 공동
으로 청구할 수 있다. 그런데 민법상 정정 보도 청구권이 성
립하려면 언론중재법과 달리 언론사의 고의 또는 과실이 있
다는 것과, 해당 보도에 위법성이 있음이 입증되어야 한다. 만약 언론 보도가 타인의 명예를 훼손했다 하더라도 해당 보
도가 공공의 이익을 위한 것일 때는 위법이 아니라고 인정된
다. 이처럼 민법상 정정 보도 청구권은 언론중재법상 정정 
보도 청구권을 행사하는 것보다 엄격한 성립 요건을 필요로 
한다.<br> 정정 보도 청구권 및 반론 보도 청구권은 피해를 입은 개
인의 입장을 제공하게 하여 개인의 피해 회복을 ⓔ 돕고 우리 
사회가 진실을 발견하고 올바른 여론을 형성하는 데 일조한다.


`
var q20003 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go2/kor_mun_P5SP1P3D.pdf">해당모의고사다운로드</a><br>
<img src="img/g2/3.png"><br>
<img src="img/g2/3-1.png"><br>
우리는 냄새를 어떻게 인식할까? 냄새의 원인이 되는 기체 
상태의 분자가 코로 들어온 후 몇 가지 과정을 거쳐 뇌에서 
냄새를 인식하게 된다. 과학자들은 분자의 구조와 뇌가 인식
하는 냄새 사이에 직접적인 관련이 있다고 추측하고 이를 밝
히려고 했으나 한계에 부딪혔다. 단일 분자 물질이 농도에 
따라 전혀 다른 냄새로 인식되는 경우를 설명할 수 없었기 
때문이다. 이후 다른 감각들은 자극이 전기 신호로 바뀌어 
인식된 것이라는 점에 착안하여 후각을 이해하려는 접근이 
도입되었다. 20세기 후반에 미국의 과학자인 액설과 벅은 냄
새 분자를 전기 신호로 전환하는 매개체인 후각 수용체를 발견
했다. 후각 수용체를 중심으로 후각 자극의 신호 전달 과정 을 
살펴보자.<br> 코안의 가장 윗부분에 후각 수용체가 있는 엄지손톱 크기
의 후각 상피가 있다. 냄새 분자는 우리가 호흡할 때 공기에 
실려 후각 상피로 가는데, 방향에 따라 정방향 경로와 역방
향 경로가 있다. 전자는 숨을 들이쉴 때 신체 외부에 있던 
냄새 분자가 콧속으로 유입되는 경로이고, 후자는 신체 내부
에 있던 냄새 분자가 목구멍을 통해 코 뒤로 올라가 숨을 내
쉴 때 후각 상피에 도달하는 경로이다. 후자를 통해 이동한 
냄새 분자는 미각으로 느낀 맛을 더욱 풍부하게 할 수 있다.<br> 이러한 경로를 통해 
냄새 분자가 도달한 
㉠ 후각 상피에는 냄
새를 받아들이는 후각 
신경 세포 수백만 개
가 밀집해 있다. 세포
의 말단에는 가느다란 
섬모들이 뻗어 나와 
얇은 점액질층에 잠겨 있고, 섬모 표면에는 특정한 몇 종류
의 분자와 선택적으로 결합하는 막단백질인 후각 수용체가 
점점이 박혀 있는데 한 개의 후각 신경 세포에는 한 종류의 
후각 수용체만 존재한다. 냄새 분자는 점액질층을 통과하여 
후각 수용체와 결합한다. 대부분의 냄새에는 수백 종류의 분
자가 포함되는데, 이 냄새 분자와 특이적으로 결합하는 후각 
수용체가 동시에 활성화된다. 인간은 약 400종류의 후각 수
용체로 1만여 가지의 냄새를 맡을 수 있다. 
<br> 후각 수용체가 활성화되면 후각 신경 세포의 세포막 안팎
에 전압 차가 만들어지면서 후각 신경 세포에서 전기 신호가 
발생한다. 이 신호는 후각 신경 세포에서 뻗어 나온 긴 돌기
인 축삭을 타고 뼈의 구멍을 통해 뇌로 올라가 ㉡ 후각 망울
에 있는 토리로 전달된다. 하나의 토리에는 동일한 종류의 
후각 수용체가 활성화되어 만들어진 모든 전기 신호가 모인
다. 이때 수천 개의 토리 중 신호를 전달받은 토리들이 패턴
을 만드는데, 신호의 세기도 패턴에 반영된다. 냄새마다 고유
한 일종의 패턴 지도가 있어 다른 냄새와 구별할 수 있는 특
징이 된다. 단일 분자로 이루어진 물질이라도 농도에 따라 다
른 패턴이 만들어진다면 우리는 이를 전혀 다른 냄새로 인식
한다.<br> 후각 망울의 토리에서 만들어진 패턴은 신경 세포인 승모 
세포를 통해 전기 신호가 강화되어 대뇌로 전달되고, 대뇌의 
다양한 정보들과 합쳐져 최종적으로 냄새를 인식하게 된다. 
승모 세포가 연결된 대뇌의 후각 겉질에는 과거에 맡았던 냄
새 정보가 저장되어 있어 새로운 냄새의 정보를 기존의 것과 
비교하고, 냄새 정보를 편도체, 해마, 눈확이마 겉질 등 대뇌
의 다른 영역으로 보낸다. 이 냄새 정보는 정서 반응에 관여
하는 편도체 및 기억을 담당하는 해마로 즉시 전달된다. 이 
때문에 어떤 냄새를 맡으면 무의식중에 즐겁거나 불쾌한 감
정을 느낄 수도 있고, 순식간에 과거의 기억이 ⓐ 떠오를 수
도 있다. 그리고 눈확이마 겉질에서는 개인의 경험, 기대, 상
황 등의 정보를 종합하여 최종적으로 어떤 냄새인지 판단하
여 냄새를 인식하게 된다.

`
var q20004 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go2/kor_mun_P5SP1P3D.pdf">해당모의고사다운로드</a><br>
<img src="img/g2/4.png"><br>
다산 정약용이 생각하기에 당대 사람들이 인정했던 최고의 
진리는 유가의 경전이다. 다산은 유가의 경전을 철저하게 연
구하고 재해석함으로써 시대가 당면한 어려움을 돌파하고 세
상을 바꾸려고 하였다. 새로운 시대를 열기 위해 과거로 달
려갔다는 점에서 다산은 전통의 충실한 계승자이지만 단순한 
계승에 그치지 않고 유가 경전을 재해석하면서 새로운 사유
를 전개하였다. 경전에 대한 새로운 해석을 통해 이루어진 
다산 윤리학의 특징을 살펴보자. 
<br> 정약용에 따르면 인간은 선천적으로 선을 좋아하고 악을 
부끄러워하는 마음이 있다. 하지만 실제 행동에 있어서는 악
은 행하기가 쉽고 선은 행하기가 어렵다고 보았다. 이러한 
인간에게 자유의지가 선천적으로 주어져 선과 악을 자율적으
로 선택할 수 있는데 자유의지에 의한 선한 행위가 공적이 
될 수 있고 악한 행동이 죄가 될 수 있다고 하였다. 즉 인간
은 자유의지에 의해서 선을 선택할 수도 악을 선택할 수도 
있으며 그에 따른 책임을 갖는다고 본 것이다. 다산은 사회
를 선하고 정의롭게 하기 위해서 선한 의지와 지혜로운 선택
이 필요하며 이러한 의지와 선택을 생활 속에서 실천해야 한
다고 했다.<br> 정약용은 인간은 자유의지로써 행동하여 인(仁)을 성취할 
수 있다고 보았다. 그는 인을 사람과 사람 사이에서 각자가 
상대에게 마땅한 도리를 다하는 실천을 통해서 얻어지는 덕
목이라고 해석하였다. 따라서 인은 다른 사람과 함께하지 않
으면 성립하지 않는다. 특히 위정자로서 정약용은 백성들의 
삶을 윤택하게 하여 인을 성취하고자 하였다. 다산이 유배지
에서 세상에 나갈 수 없게 된 상황을 절망으로 받아들일 수
밖에 없었던 이유가 바로 여기에 있다. 
<br> 그렇다면 정약용이 인을 완성할 수 있는 실천 원리로 제시
한 것이 무엇일까? 서(恕)이다. 정약용이 말하는 서란 사람
들 간의 관계에서 자신이 원하지 않는 것을 상대에게 하지 
않는 것이다. 나아가 자신이 상대에게 바라는 것을 먼저 상
대에게 해 주는 것이다. 이러한 서로써 다른 사람을 대하는 
것이 도리를 다하는 것이다. 다산은 맹자에 나오는 만물의 
이치가 모두 자신에게 있다는 뜻의 ‘만물개비어아(萬物皆備
於我)’에 대한 해석을 다음과 같이 한다. “내가 재물을 좋아
하니 백성도 재물을 좋아함을 알 수 있다. 내가 편안함을 좋
아하니 백성도 편안함을 좋아함을 안다. 내가 천대하고 업신
여김을 당하기 싫어하니 백성도 그러함을 안다. 다른 사람의 
감정을 묻고 안색을 살핀 다음에야 그들이 나와 같다는 것을 
알 수 있는 것은 아니다.” 이러한 해석에서 보듯이 다산은 인
간의 감정과 생각에 보편성이 있으므로 자기의 감정과 생각
을 미루어서 다른 사람의 마음을 이해할 수 있다고 인식한
다. 서는 타자에 대한 상호 평등성의 인정과 인격 존중에 기초
하고 있으며 누구나 노력하면 실천할 수 있는 행위 원리이다.<br> 다산은 서를 행할 수 있는 기본이 되는 자세를 신독(愼獨)
이라고 보고 신독은 ‘두려워하고 공경하는 자세’라고 하였다. 두려움과 공경의 대상은 바로 하늘이다. 정약용은 인간에게 
선과 악을 선택할 수 있는 선천성을 부여한 존재인 하늘을 
두려워하고 공경해야 선을 실천하는 마음을 유지할 수 있다
고 보았다. 정약용은 당시 사대부들에게 군주와 백성의 눈은 
피할 수 있어도 하늘의 눈은 피할 수 없다는 점을 강조한 것
이다. 정약용은 신독 공부를 남들이 모르는 일에도 생각과 
행동을 조심하는 것이며, 자신이 했던 행동을 되돌아보고 성
찰하면서 허물과 과오를 꾸짖는 내면의 목소리에 귀를 기울
이는 것이라고 하였다. 또한 신독 공부를 평상시에도 할 것
을 강조하며 이를 통해 경건한 태도를 몸에 익혀야 한다고 
역설하였다. 신독 공부를 통해서 내면의 진실성을 유지하고 
선과 악을 선택할 수 있는 상황에서 자기를 통제하는 내면의 
공정성을 유지할 수 있다고 하였다. 다산 윤리학에서 신독은 
인간관계에서 적극적인 윤리적 실천을 통해 선의 가치를 실
현하도록 하는 힘이며 정신적 구심점이다. 
<br> 다산 윤리학은 생활 속에서 선의 실천을 지향하는 생활 현
장의 윤리이다. 실천하는 것과 평상시에 마음을 수양하는 것
을 통해 타인에 대한 지극한 사랑이라는 최종 목적을 이루고
자 한 것이다. 다산에게 중요한 것은 결국 ㉠ 상호 주관적 공
동 세계인 것이다

`
var q20005 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go2/kor_mun_J9497Q75.pdf">해당모의고사다운로드</a><br>
<img src="img/g2/5.png"><br>
<img src="img/g2/5-1.png"><br>
소크라테스 이후의 전통 형이상학에서는 현실 세계를 불완전
하고 거짓된 세계로 간주하고, 보편적 진리로 이루어진 현실 너
머의 세계를 참된 세계라고 여겼다. 그들은 삶의 목적이 현실 너
머에 있는 초월적 가치의 추구에 있다고 보았으며, 이성적 사유
를 통해 이를 발견하고자 하였다. 이것은 삶의 외부에 있는 절대
적 가치를 토대로 삶의 의미를 찾고자 하는 사유 방식이었다. 바
로 이 점에 반기를 든 철학자가 니체이다.<br> 니체에 따르면, 삶은 삶을 둘러싼 가치들의 근원이며, 가치 평
가의 출발점이다. 그리고 가치는 삶에 유용한가, 즉 그것이 삶을 
더 강하게 만들어 주는가에 따라 평가된다. 그런데 전통 형이상
학은 ㉠ ‘도덕적 선’이라는 절대적 가치를 삶의 궁극적인 목적으
로 여기고, 이에 따라 개별적 삶을 재단하려 하였다. 이에 따르
면 삶의 본능적 욕망은 억압되어야 하는 것이며, 현실적인 삶은 
개선되어야 하는 부정적인 것이다. 따라서 현실적인 삶을 긍정
하고 그 속에서 끊임없이 발전하고자 하는 태도는 ‘도덕적 선’에 
부합하지 않는, 무가치한 현실적 욕구들을 충족하려는 태도에 
지나지 않게 된다. 결국 현실적인 삶 자체도 무의미한 것이 되고 
만다. 니체는 그 자체로 목적이어야 할 삶을 초월적 가치 실현의 
수단으로 간주하는 전도된 사유 방식에 전적으로 반대하였다.<br> 니체는 전통 형이상학의 도덕 가치를 좇으며 ‘노예’로 살아가
는 대신 각자가 ‘주인’으로서 스스로의 삶을 살아갈 것을 강조했
다. 그러기 위해서는 끊임없이 무언가를 넘어서고 더 높은 것으
로 나아가고자 하는 욕망, 즉 Ⓐ‘힘에의 의지’가 필요하다고 보
았다. 이것은 자신 내면의 힘과 능력을 더 높은 차원으로 발휘하
고자 하는 의지이기도 하다. 하나의 ‘힘에의 의지’가 다른 ‘힘에
의 의지’를 이겨도 또 다른 ‘힘에의 의지’가 수시로 나타나므로, 이것은 창조와 생산이 무한히 이루어지게 하는 의지이다. 니체
는 ‘힘에의 의지’를 자연스러운 것으로 수용할 때 현재의 자신을 
극복하고 새로운 가치를 창조할 수 있다고 보았다.<br> 니체에 따르면, 삶을 긍정하고 상승시키고자 하는 ‘강자’들은 
삶에 유용한 가치들을 끊임없이 추구한다. 각각의 삶이 자신의 
상승을 위해 ‘힘에의 의지’를 중심으로 경합하기도 하는데, 이때 
필요한 것이 ‘아곤(Agon)’, 즉 경쟁이다. 이것은 자신과 동등하
거나 자신보다 뛰어난 사람을 넘어서려고 하는 것으로, 자신이 
가진 힘의 크기를 확인하고 더 상승시키기 위해 필요한 과정이
다. 그렇기에 아곤의 궁극적 목적은 경쟁자의 제압이 아니라 자
신의 성장에 있다. 자신이 뛰어넘고자 하는 강자는 자신을 자극
하고 발전시키는 선의의 파트너가 된다. 상대를 이기고자 하는 
데서 오는 고통이 클수록 상대가 강하다는 뜻이며, 이때 고통은 
오히려 성장의 원동력이 된다. 물론 강자들 사이에서도 힘의 차
이에 따르는 위계는 존재한다. 그러나 이때의 위계는 일방적 계
급 질서가 아니다. 승패는 존재하지만, 비교를 통해서 자신의 힘
을 평가하고 좀 더 성장하고자 노력하였음을 서로 인정하므로, 강자와 상대적 약자 간의 힘의 위계는 지배적 형태가 아니라 상
호 존중의 형태로 드러난다. 즉, 니체의 아곤은 자신의 삶을 긍정
하고 자신의 성장을 위해 타자를 존중하는 태도라고 할 수 있다.<br> 니체는 삶을 긍정한다는 것은 삶이 마주하는 어려움을 잘 극
복하고 성장하고자 하는 태도를 의미한다고 보았다. ‘강자를 넘
어서려고 하는 의지’를 옹호한 니체의 철학은, 현실을 살아가는 
우리 자신의 삶을 그 자체로 긍정할 수 있는 철학적 토대를 마
련하였다는 점에서 의미가 있다.

`
var q20006 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go2/kor_mun_J9497Q75.pdf">해당모의고사바로가기</a><br>
<img src="img/g2/6.png"><br>
<img src="img/g2/6-1.png"><br>
과학수사에서 ‘DNA 분석’은 범인을 ⓐ추정하거나 피해자의 
신분 등을 확인할 때 중요한 수단으로 사용된다. DNA 분석이란 
혈흔이나 모발 같은 샘플로부터 DNA를 ⓑ 채취하여 동일인 여
부를 확인하는 방법으로, 현재 ‘STR 분석법’이 가장 많이 사용
되고 있다. ‘STR(Short tandem repeat)’은 ‘짧은 연쇄 반복’이라
는 뜻으로, ‘STR 분석법’은 DNA의 특정 구간에서 짧은 염기 서
열이 연쇄적으로 반복하여 나타나는 부분을 분석하는 방법이다.<br> STR 분석법의 원리를 알기 위해서는 상동 염색체, DNA, 염
기 서열에 대한 이해가 필요하다. 체세포의 핵에는 모양과 크기
가 동일한 염색체가 2개씩 쌍으로 존재하는데, 이들 염색체를 
‘상동 염색체’라 한다. 상동 염색체는 부계(父系)와 모계(母系)
에서 각각 하나씩 물려받는다. 이 상동 염색체를 구성하는 가장 
중요한 물질이 유전자를 포함하고 있는 DNA이다. DNA는 아데
닌(A), 구아닌(G), 사이토신(C), 타이민(T)이라는 네 종류의 
염기 약 30억 개로 구성되는데, 이 염기들이 ‘AGGCTA⋯’와 같
은 형태로 이어져 있다. 이것을 DNA의 염기 서열이라고 한다.<br> 상동 염색체 내 특정 위치의 DNA 염기 서열을 분석해 보면 
짧은 염기 서열이 연속적으로 반복해서 나타나는 특정 구간이 
있다. 그리고 사람마다 반복되는 횟수가 다르다는 특징이 있다. STR 분석법은 바로 이 점에 ⓒ 착안하여 샘플 간 비교를 통해 
동일인 여부를 확인한다.<br> STR 분석을 하기 위해서는 먼저, 분석하려는 염색체 내의 
위치가 ⓓ 특정되어야 하는데, 이때 그 위치를 ‘좌위’라고 한다. 상단부
<br>
‘갑’이라는 사람의 어떤 좌위가 <그림>과 같이 ‘4q31.3’일 때, 이 좌위의 ‘4’는 염색체 번호를, ‘q’는 염색체 하단부를, ‘31.3’
은 염색대* 번호를 가리킨다. 이 좌위에는 염기 서열 ‘CTTT’가 
반복되고 있는데, 왼쪽 염색체에서는 세 번, 오른쪽 염색체에서
는 다섯 번 반복되고 있다. 이 경우 분석된 결과를 왼쪽부터 
표시하여 ‘3-5’ 형태로 나타낼 수 있다. 즉, ‘갑’은 4번 염색체 
하단부(q)의 31.3번 염색대 위치에 ‘CTTT’가 ‘3-5’인 유전형
을 가지고 있는 것이다. 이렇게 상동 염색체의 특정 위치에 나
타나는 STR을 분석하여 ‘3-5’와 같은 결괏값으로 표기하는 것
을 ‘DNA 프로필’이라고 한다.<br> 현재 우리나라를 비롯한 여러 나라에서는 20개의 좌위를 표
준으로 하여 과학수사에 동일하게 활용하고 있다. 비교 샘플의 
DNA 프로필이 20개 좌위에서 모두 동일하다면, 비교 샘플이 
동일인의 것일 확률이 100%에 가깝다. 이런 이유로 STR 분석
법은 과학수사에서 큰 성과를 거두고 있으며, 관련 기술이 발
전할수록 좌위의 개수도 늘어나 더 ⓔ 정밀한 분석이 가능할 
것이다. * 염색대 : 염색체를 염색할 때 발생하는 띠 모양.

`
var q20007 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go2/kor_mun_J9497Q75.pdf">해당모의고사다운로드</a><br>
<img src="img/g2/7.png"><br>
㉠ ‘완전경쟁시장’은 많은 수의 수요자와 공급자 사이에 동질
적인 상품이 거래되는 시장으로, 다른 기업의 시장 진입을 막는 
진입장벽이 없어 누구나 들어와 경쟁할 수 있는 시장구조를 말
한다. 이에 반해 ㉡ ‘독점시장’은 비슷한 대체재가 없는 재화를 
한 기업이 독점적으로 공급하는 극단적인 시장으로, 자원의 희
소성이나 기술적 우월성 등으로 인해 진입장벽이 존재하는 시
장구조를 말한다.<br> 완전경쟁시장에서는 경쟁자가 다수이기 때문에 개별 공급자
와 수요자가 가격에 영향을 미치기 어렵다. 이때 기업은 ‘가격
수용자’로서 시장에서 결정된 가격을 그대로 받아들일 수밖에 
없고, 시장가격으로 원하는 물량을 얼마든지 판매할 수 있다. 또한 제품을 한 단위 더 판매함으로써 추가로 얻게 되는 한계
수입은 일정하며, 가격과 거래량도 수요와 공급이 일치하는 지
점에서 결정된다. 반면에 독점시장에서 기업은 ‘가격결정자’로서 
시장가격을 조정할 힘을 가지며, 이를 통해 이윤을 극대화할 수 
있다. 따라서 독점기업은 더 높은 가격을 받으면서 더 적은 제
품을 생산할 수 있는 시장지배력을 가진다. 그렇다면, 독점기업
은 이윤 극대화를 위한 가격과 생산량을 어떻게 결정할까?<br>
시장의 유일한 공급자인 독점기업이 생산량을 줄이면 시
장가격이 상승하고, 반대의 경우 시장가격이 하락한다. 가령 
독점기업이 생산한 제품 한 단위를 100만 원에 판매할 경
우, 생산량을 한 단위 더 늘려 두 단위를 판매한다면 가격
을 이전보다 낮춰야 다 팔 수 있다. 이때의 가격을 90만 원
이라 한다면 총수입은 180만 원이 되고, 제품을 한 단위 더 
판매했을 때 추가로 얻는 한계수입은 80만 원이 된다. 즉, 독점기업이 생산량을 늘리면 종전 판매 가격도 함께 낮춰야 
하기 때문에, 독점기업의 한계수입은 가격보다 항상 낮다. 이때 독점기업은 이윤 극대화를 위해 한계수입과 더불어 한
계비용을 고려한다. 한계비용은 제품을 한 단위 더 생산할 
때 추가로 드는 비용을 말한다. 만일 한계수입이 한계비용
보다 높으면 생산량을 증가시키고, 반대의 경우 생산량을 
감소시킴으로써 한계수입과 한계비용이 일치하는 지점에서 
최적 생산량을 결정한다. 이후 독점기업은 이윤 극대화를 
위해 수요자들의 최대 지불 용의를 고려하여 최적 생산량을 
판매할 수 있는 최고가격을 찾아낸다. 즉, 해당 생산량에서 
수요자가 최대로 지불할 수 있는 금액이 최종 시장가격으로 
결정되는 것이다. 이처럼 독점시장에서 기업은 시장가격의 
상승을 유발하여 수요자에게 부정적 영향을 끼치고, 시장의 
비효율성을 유발할 수 있다.

`
var q20008 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go2/kor_mun_J9497Q75.pdf">해당모의고사다운로드</a><br>
<img src="img/g2/8.png"><br>
공정거래법이라고도 불리는 ‘독점규제 및 공정거래에 관한 법
률’에서는 사업자의 독과점 자체를 금지하지는 않으나, 시장 지
배적 지위 남용과 부당한 공동행위 등 경쟁 제한 행위로 인하
여 일정한 폐해가 초래되는 경우에는 이를 규제하는 ‘폐해규제
주의’를 ⓐ 취하고 있다.<br> 시장 지배적 지위 남용은 거래 상대방으로부터 독점적 이익
을 과도하게 얻어내는 ‘착취 남용’과 현실적 ․ 잠재적 경쟁사업자
의 사업 활동을 방해하거나 배제하는 ‘방해 남용’으로 ⓑ 나눌
수 있다. 먼저, 착취 남용은 정당한 이유 없이 상품 가격이나 
용역 대가를 변경하거나, 출고량 조절로 시장가격의 상승이나 
하락에 중대한 영향을 끼친 경우를 ⓒ 말한다. 다음으로 방해 
남용은 시장 지배적 사업자와 경쟁 관계에 있는 다른 사업자의 
사업 활동을 부당하게 방해하거나, 신규 경쟁사업자의 시장 진
입을 배제하여 경쟁 제한의 폐해를 초래하는 것이다. 대표적으
로는 ‘약탈적 가격 설정’과 ‘배타조건부 거래’가 있다. 약탈적 가
격 설정은 상품 또는 용역을 통상적인 가격에 비하여 부당하게 
낮은 대가로 공급하거나 높은 대가로 구매하여 경쟁사업자를 
배제하는 것이다. 그리고 배타조건부 거래는 다른 경쟁사업자와 
거래하지 않는 조건으로 거래 상대방과 거래하는 행위를 말한
다. 이 경우 시장 지배적 사업자의 일방적, 강제적 요구뿐만 아
니라 거래 상대방과 합의하여 결정한 경우도 모두 포함된다.<br> 공정거래법에서는 사업자의 부당한 공동행위 또한 제한하고 
있다. 흔히 ‘카르텔’이라고 ⓓ 불리는 부당한 공동행위는 동일 
업종의 복수 사업자가 경쟁의 제한을 목적으로 가격, 생산량, 거래조건, 입찰 내용 등을 합의하여 형성하는 독과점 형태를 말
한다. 이때 합의는 명시적 합의뿐만 아니라 묵시적 합의 모두를 
포함한다. 이러한 담합*은 사업자 간에 은밀하게 ⓔ 이루어지는
경향이 많아 위법성을 입증하기가 어렵다. 따라서 입증 부담을 
경감하고 규제의 실효성을 높이기 위해 둘 이상의 사업자 간에 
경쟁 제한적인 합의만 있다면, 비록 그것이 실행되지 않았다 하
더라도 부당한 공동행위가 성립한 것으로 본다.<br> 공정거래법을 위반하면 공정거래위원회는 해당 사업자에게 
시정 조치를 명하거나, 금전적 제재 수단으로 과징금을 부과할 
수 있다. 이를 통해 과도한 경제력의 집중을 방지하고, 국민 경
제의 균형 있는 발전을 도모하고 있다. * 담합 : 서로 의논해서 합의함.


`
var q20009 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230323/go2/kor_mun_46J3446R.pdf">해당모의고사다운로드</a><br>
<img src="img/g2/9.png"><br>
세포핵 속 DNA에 저장된 생물체의 유전 정보는 mRNA로 
전사되어 세포질로 내보내진 후 리보솜을 통해 단백질로 합성
된다. 바이러스는 단백질로 둘러싸인 DNA나 RNA를 유전 물
질로 갖는 기생체로, 생물체에 침입하여 자신의 유전 물질을 
mRNA로 바꾼 뒤 숙주 세포가 스스로 바이러스 단백질을 합
성하게 한다. 이에 대항해 생물체는 바이러스 단백질을 항원으
로 인식하고 항체를 만들어 대항하거나 기억 세포를 생성해 
같은 바이러스가 침입할 경우를 대비한다. 따라서 바이러스를 
인공적으로 흉내 낸 물질인 백신을 접종하여 면역 반응을 일
으키면 바이러스 감염에 미리 대비할 수 있다.<br> mRNA 백신 은 바이러스 단백질의 유전 정보를 암호화한 
ⓐ mRNA를 접종하는 것으로, 주입된 mRNA를 통해 바이러스 
단백질을 합성하여 면역 반응을 유도한다. 바이러스를 배양하
여 접종하는 기존의 백신과 달리 mRNA 백신은 바이러스가 
아니기 때문에 인체가 바이러스에 감염될 위험이 없으며 체내 
효소에 의해 쉽게 분해된다. 반면 이처럼 체내에서 불안정할 
뿐 아니라 분자의 크기가 크고 음전하를 띠고 있어 세포에 거
의 흡수되지 않는 문제가 있다. 따라서 mRNA를 보호하여 세
포 내로 진입시키기 위해 지질 나노 입자를 이용한다.<br> 지질 분자는 지방산으로 이루어져 있기 때문에 물 분자와 
섞이지 않는 소수성을 갖는다. 물은 분자 내 전하가 양극으로 
분리된 상태인 극성을 띠거나 분자가 전하를 띠는 물질, 즉 친
수성 물질과만 섞이고 소수성 물질은 소수성 물질과만 섞이기 
때문이다. 한편 ㉠ 생물체의 세포막은 인지질로 구성되는데, 인지질은 지방산으로 이루어진 소수성 꼬리와 음전하를 띤 ⓑ
인산기 머리를 갖고 있다. 따라서 인지질은 친수성 용매나 소
수성 용매 모두와 섞이는 양친매성 물질이다. 이에 따라 인지
질의 친수성 머리는 세포 외부나 세포질의 수용액에 접하고 
소수성 꼬리는 소수성 분자 간의 인력으로 인해 서로 몰려 있
는 상태로 세포막이 구성된다. 세포막의 이러한 특징으로 인해 
친수성 물질이 세포막을 투과하는 것이 차단된다.<br> 양이온성 지질을 지질 나노 입자로 사용하면 mRNA와 세포
막 사이에 전기적 반발력이 발생하는 것을 막을 수 있다. 음전
하를 띤 mRNA가 양이온성 지질로 둘러싸이면 음전하를 띤 
세포막의 인산기 머리와 서로 반발하지 않기 때문이다. 그런데 
양이온성 지질은 실험실 환경에서는 mRNA를 세포 내로 진입
시키는 데 도움이 되지만 체내에서는 양이온성 지질에 ⓒ 혈장 
단백질이 흡착되어 mRNA의 세포막 투과가 제한된다.<br> 따라서 용액의 pH*에 따라 양이온성이 달라지는 ⓓ 이온화 
지질을 지질 나노 입자의 재료로 사용한다. pH가 낮은 용액
에서는 수소 이온 농도가 높으므로 이온화 지질이 양이온화된
다. 반면 pH가 높은 용액에서는 수소 이온을 적게 받아들여 
이온화 지질이 전기적으로 중성이 되므로 이온화 지질에 혈장 
단백질이 흡착되지 않는다. 즉 낮은 pH에서 mRNA와 이온화 
지질을 결합시킨 뒤 pH를 높이면 중성의 ‘mRNA - 지질 나노 
입자 복합체’를 만들 수 있고, 이 복합체는 세포막의 수용체
에 결합하여 내포 작용에 의해 세포 내부로 진입할 수 있다. 내포 작용이란 일종의 생화학적 싱크홀 현상으로, 세포막의 
일부가 수용체에 결합한 외부 물질과 함께 세포질로 함입되는 
현상이다. 내포 작용이 일어나면 세포질 안에 엔도솜 구조체
가 형성된다. 세포질에서 엔도솜 내부는 산성화되는데, 이에 
따라 ㉡ 세포막에서 유래한 엔도솜 막이 불안정해져 mRNA가 
세포질로 방출된다. 그리고 방출된 mRNA가 리보솜과 결합하
여 바이러스 단백질을 합성하고 기억 세포를 생성함으로써 인
체가 바이러스 감염에 대비할 수 있게 된다. * pH : 수용액의 수소 이온 농도를 나타내는 지표. 중성 수용액의 pH는 
7이며, 산성 용액에서는 7보다 낮다.

`
var q20010 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230323/go2/kor_mun_46J3446R.pdf">해당모의고사다운로드</a><br>
<img src="img/g2/10.png"><br>
주택 임대차는 임차인이 주택의 소유자인 임대인에게 보증
금을 지급하고 합의한 기간 동안 목적물인 주택을 사용한 후, 기간이 만료되면 보증금을 반환받는 계약이다. 임대차를 체결
하여 임차인에게 발생하는 권리인 ㉠ 임차권은 채권에 해당한
다. 채권을 가진 사람은 원칙적으로 특정한 채무자에 대해서만 
일정한 행위를 요구할 수 있고, 제삼자에게는 권리를 주장할 
수 없다. 반면에 소유권이나 저당권, 전세권 등 물건에 대한 
지배권이라 할 수 있는 물권은 누구에게나 주장할 수 있는 권
리이다. 따라서 물권은 일반적으로 채권에 우선하는 효력이 인
정되며, 같은 물권들 사이에서는 선순위 물권이 후순위보다 우
선한다. 그래서 임차인은 계약을 맺은 임대인에 대해서만 임차
권을 주장할 수 있고, 매매 등으로 주택의 소유권이 변경되면 
새로운 소유자에게는 임차권을 주장하지 못할 수 있다.<br> 이 문제를 해결하기 위한 방법으로 민법에는 ㉡ 전세권이 있
다. 이는 보증금을 지급하고 부동산을 약정 기간 동안 이용한 
후 부동산을 반환하고 보증금을 돌려받는 권리로, 임차권과 내
용이 같지만 물권이라는 점에서 차이가 있다. 임차한 주택에 
전세권을 설정하면 임대차 내용이 등기부에 기재된다. 등기는 
부동산에 관한 물권의 권리관계를 등기부에 기재하여 공시함
으로써 제삼자가 해당 내용을 알 수 있도록 하는 제도이다. 전
세권을 설정하기 위해서는 임대인의 동의가 필요한데 대체로 
임차인의 지위가 낮은 현실에서 임대인의 동의를 얻기는 쉽지 
않다. 이러한 임차인의 지위를 보호하여 국민 주거 생활을 안
정시키기 위해 제정된 특별법이 주택임대차보호법 이다. 이 
법률은 임차인이 일정한 요건을 갖추었을 경우 임차권에 물권
적 효력을 부여하여 임차인의 지위를 강화한다. 그 요건은 임
차인이 주택을 인도받는 것과 전입 신고를 마치는 것이다. 요
건을 충족한 다음 날부터 임차권은 제삼자에게도 대항력을 갖
는다. 요건만 갖추면 효력이 발생하고 임대인의 동의도 필요하
지 않기 때문에 임차인을 효과적으로 보호하는 것이 가능하다.<br> 대항력을 갖는다는 것은 제삼자에게도 임차권을 주장할 수 
있게 되었다는 의미이다. 예컨대 임차한 주택이 경매되면 일반
적으로 임차권은 소멸하지만 주택임대차보호법에 따른 대항력
을 갖춘 경우에는 그렇지 않다. 임차인은 이에 덧붙여 주민센
터 등의 공공 기관에서 주택 임대차 계약서에 확정일자를 받
을 수 있다. 우선변제권을 확보하기 위해서이다. 임차한 주택
이 경매되었을 때 임차인은 자신의 우선변제권 성립보다 뒤에 
설정된 물권에 우선하여 보증금을 변제받을 수 있다. 우선변제
권의 효력은 대항력과 확정일자가 모두 갖추어진 날부터 발생
한다. 또한 주택임대차보호법에서는 사회적 약자를 보호하는 
취지에서, 대항력을 갖춘 소액임차인에게는 정해진 금액까지의 
보증금을 선순위 물권자보다 우선하여 변제받을 수 있는 최우
선변제권까지 부여한다. 소액임차인으로 인정될 수 있는 보증
금의 기준과 최우선변제권으로 변제받을 수 있는 금액은 대통
령령으로 정해지며 지역에 따라 다르다.<br> 주택 임대차가 만료되었는데 임차인이 임대인으로부터 보증
금을 반환받지 못하는 일이 생기기도 한다. 이 경우 임차인은
이사를 가면 자신의 권리 순위가 상실될 수 있다는 우려를 하
게 된다. 이런 문제 때문에 주택임대차보호법에는 임차권등기
명령 제도가 포함되어 있다. 이는 종료된 임차권을 법원의 명
령으로 등기부에 공시할 수 있도록 하는 것이다. 임대차가 종
료된 후 보증금이 반환되지 않은 경우 임차인은 관할 법원에 
임차권등기명령을 신청할 수 있고, 법원이 이를 심리하여 결정
한다. 이때 임대인의 동의는 필요하지 않고, 전입 신고를 하지 
않았거나 확정일자를 받지 않았던 임차인도 임차권등기를 하
게 되면 대항력과 우선변제권을 취득하게 된다. 한편 ㉢ 임차
권이 등기된 뒤에 해당 주택에 새로 임대차를 체결한 다른 소
액임차인은 보증금의 최우선변제를 받을 수 없도록 하였다. 임
차권등기를 한 임차인이 예상하지 못한 손해를 입을 수 있기 
때문이다.

`
var q20011 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230323/go2/kor_mun_46J3446R.pdf">해당모의고사다운로드</a><br>
<img src="img/g2/11.png"><br>
출퇴근에 대한 관념은 근대 이후에 형성되었다. 집과 일터의 
경계가 뚜렷하지 않았던 전근대 사회와 달리 19세기 이후의 
도시적 삶에서는 주거를 위한 사적 공간과 노동을 위한 공적 
공간이 분리되었다. 여가를 즐길 수 있는 곳은 사적 공간으로, 경제적 활동을 하는 곳은 공적 공간으로 인식되었으며 이 둘
의 관계는 내부와 외부, 실내와 거리의 관계에 대응된다.<br> 게오르크 짐멜은 대표적인 사적 공간인 실내의 공간적 의미
를 도시의 삶과 관련지어 분석하였다. 짐멜은 도시에서 살아가
는 개인이 외적 자극의 과잉으로 인해 신경과민에 ⓐ 빠지게
되는데, 이에 대응하는 전형적인 방식이 내면으로의 침잠이라
고 설명하였다. 외부와 차단된 실내는 내면을 지키기에 가장 
유리한 공간이라는 것이다. 또한 짐멜은 개인이 개성을 실현할 
수 있는 공간이라는 의미를 실내에 부여하였다. 19세기에는 실
내를 가구와 공예품으로 빈틈없이 장식하는 것이 유행했는데, 그는 다양한 양식을 지닌 사물을 취향에 따라 조합함으로써 일
상에서 개성을 드러낼 수 있다는 점에서 이를 긍정적으로 평가
하였다. 또 양식이라는 보편적인 표현 형태를 매개로 하는 공
예품은 평온함과 안정감을 줄 수 있다고 덧붙였다. ㉠ 실내에 
대한 짐멜의 설명은 도시적 삶이 가져오는 불안과 몰개성을 사
적 공간에서 해소하려는 개인의 욕망에 부응한다. 실내가 개인
의 은신처이자 일상의 심미화를 추구할 수 있는 공간으로 자리
매김함에 따라, 거주자를 외부로부터 보호하고 자유로운 개성 
표현을 보장하는 실내의 설계가 당시 건축의 주요한 구성 원리
로 등장하였다.<br> 발터 베냐민은 실내 장식에 집착한 19세기의 주거 문화를 
‘주거 중독증’으로 표현하면서 이는 도시의 공적 공간에서 개
인적 흔적을 남길 수 없는 데 대한 보상 심리에서 기인한 것
이라고 설명하였다. 베냐민은 실내가 사회적 세계와의 연관성
을 잃어가면서 점점 더 인위적인 공간이 되었으며 그곳에서의 
은둔은 공적 공간으로부터의 도피를 의미한다고 보았다. 그는 
신화나 자연에서 모티프를 딴 가구와 공예품들의 조합을 통해 
몽환적 분위기를 조성했던 19세기의 실내 풍경을 예로 들면
서, 이러한 실내는 거주자를 환상에 빠지게 함으로써 도피에 
대한 욕망을 충족시킬 뿐이라고 주장하였다.<br> 실내에 대한 베냐민의 비판적 고찰은 사적 공간과 공적 공
간의 괴리를 문제 삼는 데로 이어지는데, 이때 베냐민이 주목
한 것은 파리의 ‘파사주’이다. 파사주는 몇 채의 건물을 잇는 
통로 형태의 상가로, 베냐민에 따르면 유행의 리듬이 지배하는 
최초의 자본주의적 소비 공간이다. 유행은 새로운 것을 부단히 
연출함으로써 상품을 향한 욕망을 재생산한다. 서로 마주 보는 
상점들이 늘어선 구조는 오가는 이들의 시선을 붙잡아 소비를 
부추겼다. 또한 파사주는 건축학적으로 거리와 실내 사이에 위
치하는 ‘사이공간’이다. 베냐민은 그렇기 때문에 파사주에서는 
외부와 내부가 혼동되는 경험이 가능하다고 보았다. 전적으로 
공적이지도 않고 사적이지도 않은 중간 영역의 존재는 경계 
해체의 단초를 제공한다.<br> 사적 공간과 공적 공간의 분리를 신봉하는 낡은 개념을 대
신할 새로운 주거 개념을 탐색하면서, 베냐민은 신건축과의 관
계에서 파사주의 의미를 다시 조명하였다. 1920년대에 등장한 
신건축은 산업 기술의 발전에도 불구하고 건축의 미학화 경향
이 지속되는 상황에 대한 반론의 성격을 띤다. 베냐민은 공간
의 이분법을 극복하려는 사유의 연장선상에서 신건축의 구성 
원리를 탐구하였다. 신건축에서는 철골을 재료로 사용하면서 
벽을 제거하는 설계가 가능해져 내부와 외부의 경계를 완화할 
수 있게 되었다. 또 빛이 투과하는 유리 사용의 확대는 내부와 
외부의 통합을 공간적으로 구현할 수 있게 했다. 이에 비해 파
사주는 새로운 재료를 사용하면서도 과거의 건축 양식들이 절
충적으로 혼합되어 지어졌다는 점에서 기술의 발전에 부합하
는 건축 양식으로 이어지지 못했다는 것이 베냐민의 설명이다. 이처럼 베냐민은 파사주의 한계를 지적하면서도, 외부로부터 
차단된 ‘그릇 속에서의 삶’이 지배했던 19세기에서 ‘관계와 투
과’의 원리가 지배하는 20세기로 넘어가는 문지방의 의미를 
파사주에서 발견하였다.

`
// var q30032 = `<a href="">해당모의고사바로가기</a><br><img src="img/g3/.png"><br>`

var q30001 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go3/korB_mun_92KUL83H.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/1.png"><br>
흔히 읽기는 듣기․말하기와 달리 영․유아가 글자를 깨치고 
나서야 시작된다고 생각한다. 그러나 대부분의 읽기 발달 연구
에서는 그 전에도 읽기 발달이 진행된다고 본다. 이 연구들에서는
읽기 행동의 특성이나 글에 대한 이해 수준 등에 따라 읽기 발달
단계를 위계화한다. 대개 ‘읽기 준비’를 하나의 단계로 보고, 이후의
단계를 ‘글자를 익히고 소리 내어 읽기’, ‘의미를 이해하며 읽기’,
‘학습 목적으로 읽기’, ‘다양한 관점으로 읽기’, ‘의미를 재구성
하며 읽기’의 순으로 나눈다.<br>
여기서 읽기 준비 단계는 읽기의 기초가 형성되는 중요한 시기
이다. 이 시기의 영․유아는 글자를 깨치지는 못하더라도 글자의
형태에 익숙해지며, 글자와 소리의 대응 관계도 어렴풋이 알게 
된다. 이 과정에서 글자가 뜻이 있고 음성으로 표현된다는 것을
알게 되는 유의미한 경험을 한다.<br>
이 연구들에 따르면 ㉠ 읽기 준비 단계에서 영․유아의 읽기 
발달은 타인의 읽기 행위를 관찰하고 글자에 대한 다양한 경험을
쌓으며 진행된다. 영․유아는 타인의 책 읽는 모습을 보며 글의
시작 부분, 글자를 읽는 방향, 책장을 넘기는 방식 등을 알게 
된다. 읽어 주는 사람의 표정이나 몸짓을 기억해 모방하기도 
한다. 의사소통의 각 영역인 듣기․말하기․읽기․쓰기는 서로 
영향을 주며 함께 발달한다. 글자를 모르는 영․유아가 책을 
넘기며 중얼거리고 책 읽는 흉내를 내는 것, 책 읽는 소리를 
들으며 따라 말하는 것, 들은 단어나 구절을 사용해 문장을 지어
말하는 것, 읽어 주는 것을 들으며 그림이나 글자 형태로 끄적
거리는 것이 이에 해당한다.<br>
읽기 발달은 일정한 시기에 급격히 이루어지는 것이 아니라
글자를 깨치기 이전부터 점진적으로 진행된다. 따라서 이 
시기에 생활 속에서, 책을 자주 읽어 주며 생각을 묻는 등 
의사소통의 각 영역이 같이 발달할 수 있도록 하는 자연스러운
지도가 읽기 발달에 도움을 준다. 읽기 준비 단계에서의 
경험은 이후의 단계에 중요한 영향을 미친다.

`
var q30002 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go3/korB_mun_92KUL83H.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/2.png"><br>
교통 이용 내역과 같은 기록은 개인의 데이터이며, 그 개인이
‘정보 주체’이다. 데이터는 물리적 형체가 없고, 복제와 재사용이
수월하다. 이 데이터가 대량으로 집적․처리되면 빅 데이터가 
되고, 이것의 정보 처리자인 기업 등이 ‘빅 데이터 보유자’이다. 산업
분야의 빅 데이터는 특정한 목적으로 활용될 수 있다는 점에서 
경제적 가치를 지닌다.<br>
데이터를 재화로 보아 소유권이 누구에게 귀속되어야 하는지에
대한 논의가 있다. 소유권의 주체를 빅 데이터 보유자로 보는 
견해와 정보 주체로 보는 견해가 있다. 전자는 빅 데이터 보유자
에게 소유권을 부여하면 빅 데이터의 생성 및 유통이 ⓐ쉬워져
데이터 관련 산업이 활성화된다고 주장한다. 후자는 정보 생산 
주체는 개인인데, 빅 데이터 보유자에게 부가 집중되는 것은 
부당하므로, 정보 주체에게도 대가가 주어져야 한다고 본다.<br>
최근에는 논의의 중심이 데이터의 소유권 주체에서 데이터에 
접근하기 위한 방안으로서의 데이터 이동권으로 바뀌고 있다. 
우리나라는 데이터에 대해 소유권이 아닌 이동권을 법으로 명문화
하여 정보 주체의 개인 정보 자기 결정권을 강화하였다. 데이터
이동권이란 정보 주체가 본인의 데이터를 보유한 자에게 데이터
이동을 요청하면, 그 데이터를 본인 혹은 지정한 제3자에게 
무상으로 전송하게 하는 권리이다. 다만, 본인의 데이터라도 
빅 데이터 보유자가 수집하여, 분석․가공하는 개발 과정을 거쳐
새로운 가치가 생성된 것은 이에 해당되지 않는다. 법제화 이전
에도 은행 간에 계좌 자동 이체 항목을 이동할 수 있는 서비스는
있었다. 이는 은행 간 약정에 ⓑ 따라 부분적으로 시행한 조치
였다. 데이터 이동권의 도입으로 쇼핑몰 상품 소비 이력 등 정보
주체의 행동 양상과 관련된 부분까지 정보 주체가 자율적으로 
통제ㆍ관리할 수 있는 범위가 확대되었다.<br>
데이터 이동권의 법제화로 기업은 데이터의 생성 비용과 
거래 비용을 줄일 수 있다. 생성 비용은 기업 내에서 데이터를
개발할 때 발생하는 비용으로, 기업이 스스로 데이터를 수집할
때보다 전송받은 데이터를 복제 및 재사용하게 되면 절감할
수 있다. 거래 비용은 경제 주체 간 거래 시 발생하는 비용
으로, 계약 체결이나 분쟁 해결 등의 과정에서 생긴다. 그런데
데이터 이동권의 법제화로, ㉮정보 주체가 지정하여 데이터를
전송받게 된 기업은 ㉯정보 주체의 데이터를 보유했던 기업
으로부터 데이터를 받으면 비용을 절감할 수 있다. 이에 따라
기업 간 공유나 유통이 촉진되고, 관련 산업이 활성화된다.<br>
한편, 정보 주체가 보안의 신뢰성이 높고 데이터 제공에 
따른 혜택이 많은 기업으로 데이터를 이동하면, 데이터가 
집중되어 데이터의 공유나 유통이 위축될 수 있다는 우려도 
있다. ㉰ 데이터 보유량이 적은 신규 기업은 기존 기업과 
거래를 통해 데이터를 수집하는 것이 데이터 생성 비용 절감
에도 효율적이다. 그런데 ㉱ 데이터가 집중된 기존 기업이 
집적․처리된 데이터를 공유하려 하지 않으면, 신규 기업의
시장 진입이 어려워져 독점화가 강화될 수 있다.

`
var q30003 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go3/korB_mun_92KUL83H.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/3.png"><br>
저울은 흔히 지렛대의 원리를 이용하거나 전기 저항 변화를 
측정하여 질량을 잰다. 그렇다면 초정밀 저울은 기체 분자나 
DNA와 같은 미세 물질의 질량을 어떻게 잴까? 이에 답하기 
위해서는 압전 효과에 대한 이해가 필요하다.<br>
압전 효과에는 재료에 기계적 변형이 생기면 재료에 전압이 
발생하는 1차 압전 효과와, 재료에 전압을 걸면 재료에 기계적 
변형이 생기는 2차 압전 효과가 있다. 두 압전 효과가 모두 생기는
재료를 압전체라 하며, 수정이 주로 쓰인다.<br>
압전체로 사용하는 수정은 특정 방향으로 절단 및 가공하여 
납작한 원판 모양으로 만든다. 이후 원판의 양면에 전극을 만든
후 (+)와 (-) 극이 교대로 바뀌는 전압을 가하면 수정이 진동
한다. 이때 전압의 주파수*
를 수정의 고유 주파수와 일치시켜 
수정이 큰 폭으로 진동하도록 하여 진동을 측정하기 쉽게 만든
것이 ㉠수정 진동자이다. 고유 주파수란 어떤 물체가 갖는 고유한
진동 주파수인데, 같은 재료의 압전체라도 압전체의 모양과 크기에
따라 달라진다. 수정 진동자에 어떤 물질이 달라붙어 질량이 
증가하면 고유 주파수에서 진동하던 수정 진동자의 주파수가 
감소한다. 수정 진동자의 주파수는 매우 작은 질량 변화에 민감
하게 변하므로 기체 분자나 DNA와 같은 미세한 물질의 질량을
측정할 수 있다. 진동자에서 질량 민감도는 주파수의 변화 정도를
측정된 질량으로 나눈 값인데, 수정 진동자의 질량 민감도는 
매우 크다.<br>
수정 진동자로 질량을 측정하는 원리를 응용하면 특정 기체의
농도를 감지할 수 있다. 수정 진동자를 특정 기체가 붙도록 처리
하면, 여기에 특정 기체가 달라붙으며 질량 변화가 생겨 수정 
진동자의 주파수는 감소한다. 일정 시점이 되면 수정 진동자의 
주파수가 더 감소하지 않고 일정한 값을 유지한다. 이렇게 일정한
값을 유지하는 이유는 특정 기체가 일정량 이상 달라붙지 않기 
때문이다. 혼합 기체에서 특정 기체의 농도가 클수록 더 작은 
주파수에서 주파수가 일정하게 유지된다. 특정 기체가 얼마나 
빨리 수정 진동자에 붙어서 주파수가 일정한 값이 되는가의 
척도를 반응 시간이라 하는데, 반응 시간이 짧을수록 특정 기체의
농도를 더 빨리 잴 수 있다.<br>
그런데 측정 대상이 아닌 기체가 함께 붙으면 측정하려는 대상
기체의 정확한 농도 측정이 어렵다. 또한 대상 기체만 붙더라도
그 기체의 농도를 알 수는 없다. 이 때문에 대상 기체의 농도에
따라 수정 진동자의 주파수 변화를 미리 측정해 놓아야 한다. 
그 후 대상 기체의 농도를 모르는 혼합 기체에서 주파수 변화를
측정하면 대상 기체의 농도를 알 수 있다. 수정 진동자의 주파수
변화 정도를 농도로 나누면 농도에 대한 민감도를 구할 수 있다.
* 주파수 : 진동이 1초 동안 반복하는 횟수 또는 전압의 (+)와 
(-) 극이 1초 동안, 서로 바뀌고 다시 원래대로 되는 횟수.


`
var q30004 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go3/korB_mun_92KUL83H.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/4_5.png"><br>
조선 왕조의 기본 법전인 󰡔경국대전󰡕에 규정된 신분제는 신분을
양인과 천인으로 나눈 양천제이다. 양인은 과거에 응시할 수 
있었지만, 납세와 군역 등의 의무를 져야 했다. 천인은 개인이나
국가에 소속되어 천역(賤役)을 담당했다. 관료 집단을 뜻하던 
양반이 16세기 이후 세습적으로 군역 면제 등의 차별적 특혜를 
받는 신분으로 굳어짐에 따라 양인은 사회적으로 양반, 중인, 
상민으로 분화되었다. 이러한 법적, 사회적 신분제는 갑오개혁
으로 철폐되기 이전까지 조선 사회의 근간이 되었다.<br>
조선 후기에 접어들어 농업 생산력의 증대와 상공업의 발달로
같은 신분 안에서도 분화가 확대되었고, 이에 따라 신분제에 
변화가 일어났다. 천인의 대다수를 구성했던 노비는 속량과 도망
등의 방식으로 신분적 억압에서 점차 벗어났다. 영조 연간에 
편찬된 법전인 󰡔속대전󰡕에서는 노비가 속량할 수 있는 값을 
100냥으로 정하는 규정을 둠으로써 속량을 제도화했다. 이는 
국가의 재정 운영상 노비제의 유지보다 그들을 양인 납세자로 
전환하는 것이 유리했기 때문이었다. 몰락한 양반들은 노비의
유지가 어려워졌기 때문에 몸값을 받고 속량해 주는 길을 선택
했다.<br>
18세기 이후 경제적으로 성장한 상민층에서는 ‘유학(幼學)’
직역*
을 얻고자 하는 현상이 나타났다. 유학은 벼슬을 하지 않은
유생(儒生)을 지칭했으나, 이 시기에는 관료로 진출하지 못한 
이들을 가리키는 직역 명칭으로 ⓐ굳어졌다. 호적상 유학은 군역
면제라는 특권이 있어서 상민층이 원하는 직역이었다. 유학 직역의 
획득은 제도적으로 양반이 되는 것을 의미하였으나 그것이 곧 
온전한 양반으로 인정받는 것을 의미하는 것은 아니었다. 당시 
양반 집단의 일원으로 인정받기 위해서는 ㉠ 유교적 의례의 
준행, 문중과 족보에의 편입 등 다양한 조건이 필요했다. 이에 
따라 일부 상민층은 유학 직역을 발판으로 양반 문화를 모방
하면서 양반으로 인정받고자 했다.<br>
조선 후기에는 신분 상승 현상이 일어나면서 양반의 하한선과
비(非)양반층의 상한선이 근접하는 모습이 나타났다. 양반들이 
비양반층의 진입을 막는 힘은 여전히 작동하고 있었지만, 비양
반층이 양반에 접근하고자 하는 힘은 더 강하게 작동했다. 유학의
증가는 이러한 현상의 단면을 보여 준다.
* 직역 : 신분에 따라 정해진 의무로서의 역할.

`
var q30005 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230906/go3/korB_mun_92KUL83H.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/5.png"><br>
<img src="img/g3/4_5.png"><br>
󰡔경국대전󰡕 체제에서 양인은 관료가 될 수 있다는 점에서 능력
주의가 일부 작동하는 것처럼 보이지만, 실제로는 양반 이외의 
신분에서는 관료가 되기 어려웠다. 이러한 상황에서 17세기의 
유형원은 󰡔반계수록󰡕을 통해, 19세기의 정약용은 󰡔경세유표󰡕 등을
통해 각각 도덕적 능력주의에 기초한 일련의 개혁론 을 제시
했다.<br>
유형원의 기본적인 생각은 국가 공동체를 성리학적 가치와 
규범에 따라 운영하고, 구성원도 도덕적으로 만드는 도덕 국가의
건설이었다. 신분 세습을 비판한 그는 현명한 인재라도 노비로
태어나면 노비로 살아야 하는 것이 천하의 도리에 어긋난다고 
보고, 노비제 폐지를 주장했다. 아울러 비도덕적 직업이라고 
생각한 광대와 같은 직업군을 철폐하고, 사농공상(士農工商)의 
사민(四民)으로 편성하고자 했다. 그는 과거제 대신 공거제를 
통해 도덕적 능력이 뛰어난 자를 추천으로 선발하여 여러 단계의
교육을 한 후, 최소한의 학식을 확인하여 관료로 임명해야 한다고
제안했다. 도덕을 기준으로 관료를 선발하고 지방에도 관료 선발
인원을 적절히 분배하면 향촌 사회의 풍속도 도덕적으로 이끌 수
있다고 본 것이다.<br>
정약용은 신분제가 동요하는 상황에서 사민이 뒤섞여 사는 
것이 교화에 도움이 되지 않는다고 보고, 사농공상별로 구분하여
거주하는 것을 포함한 행정 구역 개편을 구상했다. 이에 맞춰 
사(士) 집단을 재편하고자 했다. 도덕적 능력의 여부에 따라 추천
으로 예비 관료인 ‘선사’를 선발하고 일정한 교육을 한 후, 여러
단계의 시험을 거쳐 관료를 선발할 것을 제안했다. ㉡사 거주지
에서 더 많은 선사를 선발하도록 했지만, 농민과 상공인에도 
선사의 선발 인원을 배정하는 등 노비 이외에서 사 집단으로 
진출할 수 있도록 했다. 노비제에 대해서는 사를 뒷받침하기 
위해 유지되어야 한다고 주장했다.<br>
도덕적 능력주의와 관련하여 두 사람은 모두 사회 지배층으로
서의 사에 주목했다. 유형원은 다스리는 자인 사와 다스림을 받는
민의 구분을 분명히 하는 것이 천하의 이치라고 보고 ㉢도덕적
능력이 뛰어난 사람들로 지배층인 사를 구성하고자 했다. 정약용도
양반의 세습을 비판하며 도덕적 능력에 따라 사회 지배층을 재편
하는 데 입장을 같이했다. 또한 두 사람은 사회 전체의 도덕 
실천을 이끌기 위해 사 집단에 정치권력, 경제력 등을 집중
시키려 했고, 지배층과 피지배층 간의 차등을 엄격하게 유지하고자
했다. 내용에서 일부 차이가 있었지만, 두 사람은 사회 지배층의
재구성을 통해 도덕 국가 체제를 추구했다.

`
var q30006 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230711/go3/korB_mun_8K4766Q2.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/6.png"><br>
<img src="img/g3/6-1.png"><br>
글을 쓰는 과정에서 필자는 글의 내용을 상세하게 기술하기
도 하지만 생략하여 표현하기도 한다. 따라서 독해 과정에서 
독자는 글에 제시된 정보나 자신의 배경지식을 활용하여 생략
된 내용이나 주제, 필자의 의도까지도 추론하며 글을 읽어야 
한다. 이런 방식으로 글을 읽는 과정을 추론적 읽기라고 한다.<br> 먼저, 독해 과정에서 독자는 글에 제시된 정보를 활용
하여 추론적 읽기를 할 수 있다. 이 과정에서 독자는 글
에 사용된 단어나 문장, 담화 표지 등에서 단서를 찾거나 
글의 전체적인 맥락을 파악하여 글에 생략된 내용을 추론
한다. 이때는 글에 명시적으로 제시된 정보를 바탕으로 
추론적 읽기를 하기 때문에 꼼꼼한 읽기가 필요하다. 다
음으로는, 독자가 글과 관련된 자신의 배경지식을 능동적
으로 활용하여 추론적 읽기를 하는 방법이 있다. 이 과정
에서 ㉠ 독자는 글에서 생략된 내용이나 필자의 의도 등을 
파악하기 위해 글에 제시된 정보와 자신의 배경지식을 서
로 비교해 가며 추론적 읽기를 하게 된다. 실제 독해 과정
에서 독자는 이 두 가지 방법을 병행하며 추론적 읽기를 
한다.<br> 추론적 읽기 과정에는 글의 응집성, 글에 제시된 정보의 양
과 같은 요소들도 영향을 끼칠 수 있다. 먼저, 문장들의 연결
이 자연스럽지 않은 글은 독자가 문장 간의 관계를 재구성하
며 읽어야 하므로, 문장 간의 관계가 자연스러운 글을 읽을 때
보다 독해 과정에서 더 많은 추론이 필요하다. 또한 독자의 읽
기 능력에 비해 글에 제시된 정보의 양이 너무 많은 경우에는, 그 정보들이 오히려 독자의 추론에 부담을 주기 때문에 글의 
내용과 다른 부정확한 추론을 할 수 있다. 따라서 독자는 많은 
정보 가운데 필요한 정보를 선별하고, 선택한 정보의 중요성을 
점검해 가며 정확한 추론을 할 필요가 있다.

`
var q30007 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230711/go3/korB_mun_8K4766Q2.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/7.png"><br>
노자는 도(道)란 개체들 사이의 조화로운 관계 맺음을 가능
하게 하는 최고의 원리로, 개체들 이전에 도(道)가 미리 존재
한다고 보았다. 이와 달리 장자는 제물론에서 도(道)는 개체
들의 활동을 통해 사후적으로 만들어지는 것에 지나지 않는다
고 보았다. 그는 사람들이 걷는 길이 무수히 많은 사람들이 그 
길로 걸어다녔기 때문에 생겨난 것처럼, 도(道) 역시 미리 정
해진 것이 아니라 개체들 사이의 관계의 흔적, 혹은 소통의 결
과에 불과하다고 주장하였다. <br>
 장자는 사람들이 사용하는 언어에 대해서도 도(道)를 바라
보는 것과 같은 입장을 ⓐ 지녔다. 그는 사람들이 어떤 대상에 
이름을 붙이고 이를 통해 대상을 구분할 때, 대상을 구분하는 
이름은 대상이 본래부터 가지고 있던 속성에 따라 명명되는 
것이 아니라 자의적으로 연결된 것에 불과하다고 보았다. 즉, 대상과 이름 사이의 관계는 특정 공동체의 관습적인 언어 사
용에 의해 사람들에게 각인되고, 그 결과 대상들이 마치 실제
로 구분되어 있는 것처럼 ⓑ 여겨졌을 뿐이라고 본 것이다. 그
런 점에서 장자는 ㉠ 우리가 어떤 대상에 대해 부여한 이름은 
본질적으로 그 대상의 속성과 필연적인 관계가 없다고 주장한 
것이다.<br> 도(道)가 사후에 생성된다는 장자의 주장처럼, 왕충은 세계
에 존재하는 사물의 의미 역시 사후에 결정되며 ‘하늘의 뜻’과 
같이 자연 세계의 질서를 지배하는 원리는 따로 존재하지 않
는다고 보았다. 당시 사람들은 하늘의 뜻이 미리 정해져 있기
에 인간은 하늘의 뜻을 따라야 하며, 만약 그렇지 않으면 가뭄
과 홍수 등의 자연재해가 일어난다는 믿음을 가지고 있었다. 그러나 왕충은 논형을 통해 자연재해가 인간을 비롯한 세계
에 존재하는 사물에 영향을 미치는 것은 사실이지만, 자연재해
는 하늘의 뜻에 따라 발생한 것이 아니라 자연이 순환하는 과
정에서 우연히 나타나는 현상일 뿐이라고 주장하였다. 그런 점
에서 인간이 하늘의 작용에 영향을 미치는 것은 불가능하다고 
본 것이다.<br> 
 왕충은 하늘의 작용이 우연히 나타나는 현상인 것처럼 사람
의 삶도 우연에 의해 결정된다고 보았다. 예를 들어, 벼슬하느
냐 못 하느냐는 한 사람의 재능에 ⓒ 달린 것이 아니라, 같은 
수준의 재능을 가진 사람들이라도 만나는 시대에 따라 출세 
여부가 달라질 수 있고, 아무리 재능이 뛰어나도 재능을 알아
주는 군주를 만나지 못하면 등용될 수 없다고 생각한 것이다. 

`
var q30008 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230711/go3/korB_mun_8K4766Q2.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/7_8.png"><br>
플라톤은 사물보다 사물의 의미가 미리 존재한다고 보았다. 그래서 그는 사물에는 그것을 만든 ‘제작자’가 부여한 ‘필연적 
의미’가 있을 수밖에 없다고 보았기 때문에 우리가 사는 세계 
역시 제작자가 필연적 의미에 따라 형성한 것이라고 생각했다. 그러나 루크테리우스는 세계가 원자들로 구성되어 있으며, 세
계는 자발적으로 움직이던 원자들이 우연히 마주쳐 응고되면
서 생성되었을 뿐이라고 주장하였다. <br>
 루크테리우스는 세계가 형성되기 전에는 무수히 많은 원자
들이 원자 그 자체의 무게로 인해 서로 평행하게 떨어지는 상
태에 있었다고 생각했다. 이때 수직 낙하하던 원자들 중 하나
의 원자가 평행 상태가 깨져 거의 느껴지지도 않을 것 같은 
미세한 편차로 기울게 되면 결국 옆의 원자와 마주치게 되는
데, 이 마주침으로 인해 수많은 원자들이 연속해서 마주치게 
되면서 원자들이 응고되고 그 결과 세계가 형성되었다고 본 
것이다. 그는 한 원자에서 발생한 미세한 편차를 ‘클리나멘’이
라고 명명했는데, 원자들이 마주치거나 응고하는 방식은 미리 
결정되지 않았다고 주장하였다. 그런 점에서 우리가 살고 있는 
세계는 우연의 산물일 뿐이라고 본 것이다. 그러나 제작자가 
필연적 의미에 따라 세계를 형성한 것이라는 생각이 서양 철
학의 주류를 형성하고 있었기 때문에 이러한 루크테리우스의 
생각은 크게 주목받지 못했다.<br> 한편 기계 발명 및 기술 혁신을 계기로 발생한 산업 혁명 
이후 크게 발달한 자본주의는 빈부 격차 현상을 심화시켰고 
이는 자본가와 노동자 간의 심각한 대립을 초래하였다. 이에 
일부 철학자들은 경제적인 것이 인간 사회의 구조 및 역사 발
전 방향을 결정하는 유일한 원리라고 주장하며, 자본가와 노동
자의 갈등은 이미 정해진 역사 발전의 수순을 따르는 것에 불
과할 뿐이고 자본주의는 곧 인류 역사에서 ⓓ 사라질 것이라고 
주장하였다. 하지만 알튀세르는 복잡하고 다양한 사회 구조와 
인류의 역사 발전 과정을 한 가지 원리로만 해석할 수 없다고 
보았다. 또한 그는 루크테리우스의 철학에 영감을 받아 지금까
지의 인류 역사의 흐름은 정해진 역사 발전의 수순을 따른 것
이 아니라 단지 우연의 결과에 지나지 않을 뿐이라고 주장하
였다. 그는 18세기의 이탈리아가 자본과 기술, 노동력처럼 자
본주의가 발생할 수 있는 조건을 ⓔ 갖추었음에도 자본주의가 
발생하지 않은 사례를 통해, 많은 요소들이 우연히 마주치고 
응고되어야 자본주의가 발생하는 것이지 경제적인 것이 모든 
것을 결정하는 것은 아니라고 생각했다.<br> 만약 이 세계가 선재된 하나의 원리에 의해 만들어진 것이
라면, 인간은 이미 방향이 제시된 역사의 흐름을 따르는 존재
에 불과할 수 있다. 그런 점에서 세계 형성의 우연성을 주장한 
루크테리우스와 알튀세르의 주장은 우리가 살고 있는 세계에 
‘새로운 마주침’을 시도함으로써 다른 세계로 나아갈 수 있다
는 점을 시사했다는 점에서 의의가 있다.

`
var q30009 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230711/go3/korB_mun_8K4766Q2.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/9.png"><br>
법은 가능한 한 많은 구체적인 사안들에 적용될 수 있도록 
일반적 ․ 추상적인 규범 명제로 기술되어 있다. 따라서 법을 구
체적 사안에 적용하기 위해서는 법의 내용을 분명히 파악하고 
적용 범위를 확정하는 법의 해석이 필요하다. 법의 해석 방법
에는 입법부, 사법부, 행정부 등 국가 기관에 의한 유권 해석
과 학자들의 학문 연구를 통하여 이루어지는 학리 해석의 두 
종류가 있다. 이 중 학리 해석과 관련하여 전통적으로 문리적 
해석 방법, 역사적 해석 방법, 목적론적 해석 방법 등이 활용
되고 있다.<br> 우선 법조문의 해석은 법문에 사용되고 있는 문자의 의미와 
문장의 구조에 대한 문법적 이해를 기초로 하여 이루어져야 
한다. 이러한 해석을 ㉠ 문리적 해석 방법이라고 한다. 어떠한 
법조문이든 1차적으로는 이러한 방법으로 해석되어야 한다. 그
런데 법문에 사용되고 있는 문자 또는 법률 용어의 의미는 일
반적으로 사용되고 있는 의미와는 다른 경우가 많기 때문에 
법을 해석할 때 주의해야 한다. 그리고 법의 의미는 그 법이 
적용되는 구체적 현실과의 관련 속에서 확정되어야 하므로, 법
조문에 사용되고 있는 문자의 의미는 제정 당시의 의미가 아닌 
법이 적용되는 시점에서의 의미로 해석하는 것이 타당하다.<br> ㉡ 역사적 해석 방법은 입법자가 입법 당시에 ⓐ 가지고 있었
던 입법 의사를 확인하고 탐구하여 해석하는 방법이다. 입법자
의 입법 의사는 법제도의 연혁을 살펴보거나, 법률안을 발의하
게 된 취지를 밝힌 법안이유서, 관련 기관의 입법의견서, 회의
록 등의 입법 기초 자료를 ⓑ 가지고 파악할 수 있다. 그런데 
법은 제정 당시의 상황과 적용되는 시점의 상황이 많이 달라지
는 것이 대부분이므로 입법자의 입법 의사는 결정적인 해석 수
단이라기보다는 구속력이 없는 보조 해석 자료에 머물 수밖에 
없다.<br> ㉢ 목적론적 해석 방법은 현행 법질서 안에서 이성적 논의를 
바탕으로 해석 주체가 법문의 의미와 입법의 목적, 입법을 통
해서 추구하려는 이념과 가치, 현재의 상황에 대한 인식과 분
석 등을 고려하여 법규의 의미를 찾는 해석 방법이다. 이러한 
목적론적 해석 방법에 의할 때 법해석이란 단지 과거의 입법
자가 이미 고려했던 것을 단순히 반복하는 것이 아니라 상황
에 따라서 입법의 취지를 새롭게 밝혀내는 것이라 할 수 있다. 법의 참된 의미는 과거의 입법에 의해서 결정되는 것이 아니
라 현재의 상황에 맞게 입법 정신을 계승하는 것이므로 법률
의 문언도 단순 의미 해석을 넘어 탄력적으로 해석할 수 있어
야 한다고 본다. 또한 입법 정신에 따라 법률의 문언을 보충하
고 또 필요한 경우에는 입법 정신을 실현하기 위해 법률의 문
언에 엄격히 구속되지 않는 법해석이 인정된다고 할 수 있다.<br> 이러한 방법들은 기본적으로 법적 판단이 요구되는 사안에 
대하여 적용 가능한 법규가 분명히 존재하는 경우에 활용된다. 하지만 법문을 구성하는 법 개념 및 범주 속에 규율의 대상인 
다양하고도 발생 가능한 모든 현상과 행위들을 완벽하게 포함
시킬 수는 없다. 또한 법 제정 시점에서 그 이후에 발생 가능
한 모든 경우들을 예측하여 법으로 규정하는 것도 가능하지 
않다. 이로 인해 법의 적용 과정에서 문제점이 발생하게 되는
데 이를 법의 흠결이라 한다. 해당 사안을 규율할 법규정이 명
백히 존재하지 않는 경우를 ‘명시적 흠결’, 해당 사안을 규율할 
법규정이 존재하지만 이를 그대로 적용할 경우 매우 불합리한 
결과가 나타나는 경우를 ‘은폐된 흠결’이라 부른다. 법관은 이
러한 법의 흠결을 이유로 재판을 거부할 수 없으므로, 법의 흠
결을 보충하기 위해 다양한 방법들이 활용되고 있다.<br> 일반적으로는 유추가 법의 흠결을 보충하는 방법으로 활용
되고 있다. 유추는 직접적으로 적용 가능한 규칙이 아닌 다른 
개별적인 규칙을 문제가 되고 있는 사례에 적용하여 판단을 
내리는 것을 말한다. 따라서 유추 적용한 법적 판단이 적법하
게 이루어지고 그 타당성을 인정받기 위해서는 우선 법적 판
단이 요구되는 사안과 유사한 사안을 규율하는 법규가 존재해
야만 한다. 그리고 두 사안 사이에 상당한 유사성이 있어야 한
다. 최종적으로 유추를 통해 문제가 되는 사안에 대한 타당한 
해결이 가능하다는 법관의 판단이 필요하다.<br> 유추가 일반적으로 법의 흠결을 보충하기 위한 방법으로 활
용되고 있지만, 이는 기본적으로 법의 명시적 흠결을 보충하기 
위한 하나의 대안에 불과하다. 이 때문에 유추의 결과는 목적
론적 해석 방법 등 별도의 방법을 통하여 그 정당성이 평가되
어야 하는 한계가 있다. 또한 법의 흠결은 많은 경우에 은폐된 
형태로 존재하기 때문에 법관은 법의 흠결을 보충하기 위한 
방법을 모색해야 한다. 이와 관련하여 학자들은 법관이 ‘정의’, 
‘이성’, ‘형평’ 등 법원리적 규범을 법적 판단의 근거로 활용하
여 그 흠결을 보충할 수 있다고 본다. 이러한 원리들은 법적인 
판단이 요구되는 사안에 대하여 법관이 자의적으로 판단하는 
것을 제어하면서 합리적으로 문제의 해결에 접근할 수 있는 
방법으로 제시되고 있다. 하지만 법관이 감정적이거나 자의적
으로 판단하는 것을 완전히 배제할 수 없는 것도 사실이다. 따
라서 가능한 한, 입법 정책 차원에서 법의 흠결을 최소화하는 
것이 필요하다.

`
var q30010 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230711/go3/korB_mun_8K4766Q2.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/10.png"><br>

집중 호우나 우박, 폭설 등과 같은 기상 현상은 재해로 이어
질 수 있어 강수량을 예측하여 피해에 대비해야 한다. 최근에
는 이중 편파 레이더 관측을 통해 10분마다 강수 정보가 갱신
되는 등 보다 신속하고 정확한 기상 관측이 이루어지고 있다.<br> 그렇다면 이중 편파 레이더는 어떻게 기상 현상을 관측하는 
것일까? 기본적으로 기상 관측 레이더는 대기 중으로 송신된 
전파가 강수 입자에 부딪혀 되돌아오면 수신된 전파를 분석한 
후 여러 변수를 산출하여 강수 입자를 분석한다. 이중 편파 레
이더 역시 이 원리를 활용하는데, 먼저 송신된 전파와 수신된 
전파의 강도를 비교한 값인 반사도를 통해 강수 입자의 대략적
인 크기와 개수를 파악한다. 이중 편파 레이더가 송수신하는 전
파는 지면과 수평인 방향으로 진동하는 수평 편파와 수직인 방
향으로 진동하는 수직 편파로 이루어져 있는데, 각 편파의 반사
도를 수평 반사도, 수직 반사도라고 하며 단위로는 데시벨Z(dBZ)
를 사용한다. 이중 편파 레이더의 산출 변수로 사용되는 ⓐ반사
도는 수평 반사도를 의미하며, 단위 부피 1m3당 존재하는 강수 
입자의 크기와 개수에 비례하여 커진다. 일반적으로 강수 입자
가 작고 그 수가 적은 이슬비는 1dBZ 이하의 값을, 강수 입자
가 크고 그 수가 많은 집중 호우는 20dBZ 이상의 값을 갖는다. 그런데 우박의 경우 집중 호우와 강수 입자의 크기 및 개수가 
달라도 반사도가 집중 호우와 비슷하게 나타날 수 있기 때문에 
반사도만으로는 강수 입자의 종류를 구별하기 어려울 때가 있
다. 그래서 이를 구별하기 위해서는 다른 산출 변수가 필요하다.<br> 우선 강수 입자의 크기와 모양을 알기 위해서 ⓑ 차등반사도
를 활용할 수 있다. 차등반사도란 수평 반사도에서 수직 반사
도를 뺀 값으로, 강수 입자가 수평으로 더 길면 양의 값을, 수
직으로 더 길면 음의 값을 가지며 단위로는 데시벨(dB)을 사
용한다. 예를 들어 강수 입자가 큰 집중 호우의 경우, 빗방울이 
낙하할 때 받는 공기 저항 때문에 강수 입자가 수평으로 퍼지
게 되어 차등반사도가 2dB 이상으로 나타난다. 반면 우박이나 
눈이 녹지 않아 순수한 얼음으로 구성된 경우라면 입자의 크기
가 커도 수평으로 퍼지지 않으며, 회전 운동을 하면서 낙하하
기 때문에 레이더에서는 거의 구형으로 인식되어 차등반사도 
값이 0dB인 경우가 많다. 이를 이용하면 집중 호우와 우박의 
반사도 값이 비슷해도 기상 현상을 구별할 수 있다. 하지만 강
수 입자가 0.3mm보다 작은 이슬비도 공기 저항을 거의 받지 
않아 강수 입자가 구형을 유지하기 때문에 차등반사도가 주로 
0dB로 나타난다. 따라서 ㉠ 강수 입자의 종류를 구별하려면 반
사도와 차등반사도를 종합적으로 고려하는 것이 필요하다.<br> 한편 비나 우박과 같은 강수 입자의 종류와 강수 입자의 크기
를 아는 것만으로는 단위 부피당 강수 입자 개수를 정확히 추정
하는 데 한계가 있다. 그래서 차등위상차와 비차등위상차라는 
산출 변수를 통해 강수 입자의 개수에 대한 정보를 얻는다. 레
이더 전파가 강수 입자에 부딪히면 강수 입자의 크기와 모양에 
따라 수평 편파와 수직 편파의 진행 속도가 달라진다. 이에 따
라 두 편파의 위상도 달라지는데, 이 위상의 차이를 누적한 값
이 바로 ⓒ차등위상차이다. 단위로는 도(°)를 사용하며, 수평 
편파 위상에서 수직 편파 위상을 빼는 방식으로 위상차를 구한
다. 전파가 통과하는 강수 입자의 단면 지름이 길어질수록 위상 
값이 커지기 때문에 차등반사도와 마찬가지로 강수 입자가 수평
으로 더 길면 양의 값을 가지고, 수직으로 더 길면 음의 값을 
가지게 된다. 차등위상차는 전파의 진행 방향을 따라 계속 누적
되기 때문에 강수 입자가 존재하지 않는 곳에서도 0이 아닌 값
이 산출될 수 있다는 특징이 있다.<br> 그리고 특정 관측 범위에서 차등위상차의 변화율을 나타낸 값
을 ⓓ비차등위상차라고 한다. 만약 레이더로부터 5km 떨어진 
지점의 차등위상차가 0°이고 10km 떨어진 지점의 차등위상차
가 10°라면, 이때 5~10km 구간의 비차등위상차는 차등위상차 
변화량 10°를 전파의 왕복 거리 10km로 나눈 1°/km가 된다. 비차등위상차는 차등위상차와는 달리 강수 입자가 존재하는 곳
에서만 0이 아닌 값으로 산출되기 때문에 관측하고자 하는 특
정 구간의 강수 입자 개수를 보다 정확하게 추정할 수 있다.<br> 그런데 눈이 녹아 눈과 비가 함께 내리는 경우처럼 두 종류
이상의 강수 입자들이 혼재되어 있으면 산출 변수 값이 실제 
기상 현상보다 크거나 작게 나타나 혼란을 줄 수 있다. 이를 
해결하기 위한 산출 변수가 교차상관계수이다. 교차상관계수는 
수평 편파와 수직 편파 신호의 유사도를 나타내는 값으로, 강
수 입자들의 크기와 종류가 유사할수록 1에 가까운 값으로 산
출된다. 일반적으로 비나 눈이 내릴 때 관측 범위 내에 종류가 
같고 크기가 비슷한 강수 입자들이 분포하면 교차상관계수가 
0.97 이상으로 높게 나타난다. 하지만 여러 종류의 강수 입자
가 혼재된 경우나, 집중 호우처럼 강수 입자의 종류가 같더라
도 그 크기가 다양한 경우에는 교차상관계수가 0.97 미만으로 
나타나기도 한다.

`
var q30011 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go3/korB_mun_Y743R9KC.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/11.png"><br>
<img src="img/g3/11-1.png"><br>
선생님의 권유나 친구의 추천, 자기 계발 등 우리가 독서를 
하게 되는 동기는 다양하다. 독서 동기는 ‘독서를 이끌어 내고, 
지속하는 힘’으로 정의되는데, 이 정의에는 독서의 시작과 지속
이라는 두 측면이 포함되어 있다. 이러한 독서 동기는 슈츠가 
제시한 ‘때문에 동기’와 ‘위하여 동기’라는 두 유형을 적용하여 
설명할 수 있다.<br> 
독서의 ‘때문에 동기’는 독서 행위를 하게 만든 이유를 
의미한다. 이는 독서 행위를 유발한 계기가 되므로 독서 
이전 시점에 이미 발생한 사건이나 경험에 해당한다. 독서의 
‘위하여 동기’는 독서 행위를 통해 달성하고자 하는 목적을 
의미한다. 그 목적은 독서 행위의 결과로 달성되므로 독서 
이후 시점의 상태에 대한 기대나 예측이라는 성격을 가지며, 
달성하지 못할 가능성을 내포한다. 예를 들어, 친구에게 책을 
선물로 받아서 읽게 되었다고 할 때, 선물로 책을 받은 
것은 이 독서 행위의 ‘때문에 동기’이다. 그리고 책을 읽고 
친구와 책에 대해 대화를 나누는 것을 목적으로 설정했다면 
이는 ‘위하여 동기’가 된다. 또한 독서 행위를 통해 성취감
이나 감동을 느끼는 것, 선물로 받은 책을 읽어서 친구를 
실망시키지 않는 것 등도 이 독서 행위의 결과로 기대할 
수 있는 것이므로 역시 ‘위하여 동기’가 된다고 할 수 있다.<br>
이러한 동기 개념은 독서 습관의 형성 과정을 설명하는 데 
도움이 된다. 성공적인 독서 경험의 핵심은 독서 행위를 통해 
즐거움과 유익함을 경험하는 것인데, 이러한 경험을 하게 되면 
다른 책을 더 읽고 싶다는 마음이 들고 그러한 마음은 새로운 
독서 행위로 연결된다. 독서의 즐거움과 유익함은 새로운 독서 
행위의 이유가 된다는 점에서 ‘때문에 동기’가 된다. 동시에, 
새로운 독서 행위를 통해 다시 경험하고 싶어지는 ‘위하여 
동기’가 되기도 한다. 이러한 선순환을 통해 독서 경험이 반복
되고 심화되면서 독서 습관이 자연스럽게 형성된다. 따라서 독서 
습관을 형성하려면 ‘때문에 동기’와 ‘위하여 동기’를 바탕으로 
우선 독서 행위를 시작하는 것과, 성공적인 독서 경험을 통해 
독서 행위를 지속하는 것이 중요하다.
`
var q30012 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go3/korB_mun_Y743R9KC.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/12.png"><br>
공포 소구는 그 메시지에 담긴 권고를 따르지 않을 때의 
해로운 결과를 강조하여 수용자를 설득하는 것으로, 1950년대 
초부터 설득 전략 연구자들의 연구 대상이 되었다. 초기 연구를 
대표하는 재니스는 기존 연구에서 다루어지지 않았던 공포 
소구의 설득 효과에 주목하였다. 그는 수용자에게 공포 소구를 
세 가지 수준으로 달리 제시하는 실험을 한 결과, 중간 수준의 
공포 소구가 가장 큰 설득 효과를 보인다는 것을 발견하였다.<br>
공포 소구 연구를 진척시킨 레벤달은 재니스의 연구가 인간의 
감정적 측면에만 ㉠ 치우쳤다고 비판하며, 공포 소구의 효과는 
수용자의 감정적 반응만이 아니라 인지적 반응과도 관련된다고 
하였다. 그는 감정적 반응을 ‘공포 통제 반응’, 인지적 반응을 
‘위험 통제 반응’이라 ㉡ 불렀다. 그리고 후자가 작동하면 수용
자들은 공포 소구의 권고를 따르게 되지만, 전자가 작동하면 
공포 소구로 인한 두려움의 감정을 통제하기 위해 오히려 공포 
소구에 담긴 위험을 무시하려는 반응을 보이게 된다고 하였다.<br>
이러한 선행 연구들을 종합한 위티는 우선 공포 소구의 설득 
효과를 좌우하는 두 요인으로 ‘위협’과 ‘효능감’을 설정하였다. 
수용자가 공포 소구에 담긴 위험을 자신이 ㉢ 겪을 수 있는
것이고 그 위험의 정도가 크다고 느끼면, 그 공포 소구는 위협의 
수준이 높다. 그리고 공포 소구에 담긴 권고를 이행하면 자신의 
위험을 예방할 수 있고 자신에게 그 권고를 이행할 능력이 
있다고 느끼면, 효능감의 수준이 높다. 한 동호회에서 회원들
에게 ‘모임에 꼭 참석해 주세요. 불참 시 회원 자격이 사라집
니다.’라는 안내문을 ㉣ 보냈다고 하자. 회원 자격이 사라진다는 
것은 그 동호회 활동에 강한 애착을 가지고 있는 사람에게는 
높은 수준의 위협이 된다. 그리고 그가 동호회 모임에 참석하는 
일이 어렵지 않다고 느낄 때, 안내문의 권고는 그에게 높은 
수준의 효능감을 주게 된다.<br>
위티는 이 두 요인을 레벤달이 말한 두 가지 통제 반응과 
관련지어 다음과 같은 결론을 도출하였다. 위협과 효능감의 
수준이 모두 높을 때에는 위험 통제 반응이 작동하고, 위협의 
수준은 높지만 효능감의 수준이 낮을 때에는 공포 통제 반응이 
작동한다. 그러나 위협의 수준이 낮으면, 수용자는 그 위협이 
자신에게 아무 영향을 ㉤ 주지 않는다고 느껴 효능감의 수준에 
관계없이 공포 소구에 대한 반응이 없게 된다. 이렇게 정리된 
결론은 그간의 공포 소구 이론을 통합한 결과라는 점에서 후속 
연구의 중요한 디딤돌이 되었다.

`
var q30013 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go3/korB_mun_Y743R9KC.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/13.png"><br>
<img src="img/g3/13-1.png"><br>
분자들이 만나 화학 반응을 진행하는 데 필요한 최소한의 
운동 에너지를 활성화 에너지라 한다. 활성화 에너지가 작은 
반응은, 반응의 활성화 에너지보다 큰 운동 에너지를 가진 분자
들이 많아 반응이 빠르게 진행된다. 활성화 에너지를 조절하여 
반응 속도에 변화를 주는 물질을 촉매라고 하며, 반응 속도를 
빠르게 하는 능력을 촉매 활성이라 한다. 촉매는 촉매가 없을 
때와는 활성화 에너지가 다른, 새로운 반응 경로를 제공한다. 
화학 산업에서는 주로 고체 촉매가 이용되는데, 액체나 기체인 
생성물을 촉매로부터 분리하는 별도의 공정이 필요 없기 때문
이다. 고체 촉매는 대부분 활성 성분, 지지체, 증진제로 구성된다.<br>
활성 성분은 그 표면에 반응물을 흡착시켜 촉매 활성을 제공
하는 물질이다. 고체 촉매의 촉매 작용에서는 반응물이 먼저 
활성 성분의 표면에 화학 흡착되고, 흡착된 반응물이 표면에서 
반응하여 생성물로 변환된 후, 생성물이 표면에서 탈착되는 
과정을 거쳐 반응이 완결된다. 금속은 다양한 물질들이 표면에 
흡착될 수 있어 여러 반응에서 활성 성분으로 사용된다. 예를 
들면, 암모니아를 합성할 때 철을 활성 성분으로 사용하는데, 
이때 반응물인 수소와 질소가 철의 표면에 흡착되어 각각 원자 
상태로 분리된다. 흡착된 반응물은 전자를 금속 표면의 원자와 
공유하여 안정화된다. 반응물의 흡착 세기는 금속의 종류에 
따라 달라진다. 이때 흡착 세기가 적절해야 한다. 흡착이 약하면 
흡착량이 적어 촉매 활성이 낮으며, 흡착이 너무 강하면 흡착된 
반응물이 지나치게 안정화되어 표면에서의 반응이 느려지므로 
촉매 활성이 낮다. 일반적으로 고체 촉매에서는 반응에 관여하는 
표면의 활성 성분 원자가 많을수록 반응물의 흡착이 많아 촉매 
활성이 높아진다.<br>
금속은 열적 안정성이 낮아, 화학 반응이 일어나는 고온에서 
금속 원자들로 이루어진 작은 입자들이 서로 달라붙어 큰 입자를 
이루게 되는데 이를 소결이라 한다. 입자가 소결되면 금속 활성 
성분의 전체 표면적은 줄어든다. 이러한 문제를 해결하는 것이 
지지체이다. 작은 금속 입자들을 표면적이 넓고 열적 안정성이 
높은 지지체의 표면에 분산하면 소결로 인한 촉매 활성 저하가 
억제된다. 따라서 소량의 금속으로도 ㉠ 금속을 활성 성분으로 
사용하는 고체 촉매의 활성을 높일 수 있다.<br>
증진제는 촉매에 소량 포함되어 활성을 조절한다. 활성 성분의 
표면 구조를 변화시켜 소결을 억제하기도 하고, 활성 성분의 
전자 밀도를 변화시켜 흡착 세기를 조절하기도 한다. 고체 
촉매는 활성 성분이 반드시 있어야 하지만 경우에 따라 증진제나 
지지체를 포함하지 않기도 한다.

`
var q30014 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go3/korB_mun_Y743R9KC.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/14.png"><br>
<img src="img/g3/14_15.png"><br>
심리 철학에서 동일론은 의식이 뇌의 물질적 상태와 동일하
다고 ⓐ본다. 이와 달리 기능주의는 의식은 기능이며, 서로 다른 
물질에서 같은 기능이 구현될 수 있다고 주장한다. 이때 기능
이란 어떤 입력이 주어졌을 때 특정한 출력을 내놓는 함수적 
역할로 정의되며, 함수적 역할의 일치는 입력과 출력의 쌍이 
일치함을 의미한다. 실리콘 칩으로 구성된 로봇이 찔림이라는 
입력에 대해 고통을 출력으로 내놓는 기능을 가진다면, 로봇과 
우리는 같은 의식을 가진다는 것이다. 이처럼 기능주의는 의식을 
구현하는 물질이 무엇인지는 중요하지 않다고 본다.<br>
설(Searle)은 기능주의를 반박하는 사고 실험을 제시한다. 
‘중국어 방’ 안에 중국어를 모르는 한 사람만 있다고 하자. 그는 
중국어로 된 입력이 들어오면 정해진 규칙에 따라 중국어로 된 
출력을 내놓는다. 설에 의하면 방 안의 사람은 중국어 사용자와 
함수적 역할이 같지만 중국어를 아는 것은 아니다. 기능이 같으
면서 의식은 다른 사례가 있다는 것이다.<br>
동일론, 기능주의, 설은 모두 의식에 대한 논의를 의식을 
구현하는 몸의 내부로만 한정하고 있다. 하지만 의식의 하나인 
‘인지’ 즉 ‘무언가를 알게 됨’은 몸 바깥에서 ⓑ 일어나는 일과 
맞물려 벌어진다. 기억나지 않는 정보를 노트북에 저장된 파일을 
열람하여 확인하는 것이 한 예이다. 로랜즈의 확장 인지 이론은 
이를 설명하는 이론이다.<br>
그에 ⓒ따르면 인지 과정은 주체에게 ‘심적 상태’가 생겨나게
하는 과정이다. 기억이나 믿음이 심적 상태의 예이다. 심적 
상태는 어떤 것에도 의존함이 없이 주체에게 의미를 나타낸다. 
예를 들어, 무언가를 기억하는 사람은 자기의 기억이 무엇인지 
ⓓ 알아보기 위해 아무것에도 의존할 필요가 없다. 이와 달리 
‘파생적 상태’는 주체의 해석에 의존해서만 또는 사회적 합의에 
의존해서만 의미를 나타내는 상태로 정의된다. 앞의 예에서 
노트북에 저장된 정보는 전자적 신호가 나열된 상태로서 파생적 
상태이다. 주체에 의해 열람된 후에도 노트북의 정보는 여전히 
파생적 상태이다. 하지만 열람 후 주체에게는 기억이 생겨난다. 
로랜즈에게 인지 과정은 파생적 상태가 심적 상태로 변환되는 
과정이 아니라, 파생적 상태를 조작함으로써 심적 상태를 생겨
나게 하는 과정이다. 심적 상태가 주체의 몸 외부로 확장되는 
것이 아니라, 심적 상태를 생겨나게 하는 인지 과정이 확장되는 
것이다. 이러한 ㉠확장된 인지 과정은 인지 주체의 것일 때에만, 
다시 말해 환경의 변화를 탐지하고 그에 맞춰 행위를 조절하는 
주체와 통합되어 있을 때에만 성립할 수 있다. 즉 로랜즈에게 
주체 없는 인지란 있을 수 없다. 확장 인지 이론은 의식의 
문제를 몸 안으로 한정하지 않고 바깥으로까지 넓혀 설명한다는 
의의를 지닌다.
`
var q30015 = `<a href="https://wdown.ebsi.co.kr/W61001/01exam/20230601/go3/korB_mun_Y743R9KC.pdf">해당모의고사다운로드</a><br>
<img src="img/g3/15.png"><br>
<img src="img/g3/14_15.png"><br>
일반적으로 ‘지각’이란 몸의 감각 기관을 통해 사물에 대해 
아는 것을 의미한다. 이러한 지각을 분석할 때 두 가지 사실에 
직면한다. 첫째, 그 사물과 내 몸은 물질세계에 있다. 둘째, 
그 사물에 대한 나의 의식은 물질세계가 아닌 다른 세계에 
있다. 즉 몸으로서의 나는 사물과 같은 세계에 속하는 동시에 
의식으로서의 나는 사물과 다른 세계에 속한다.<br>
이에 대한 객관주의 철학의 입장은 두 가지로 나뉜다. 의식을 
포함한 모든 것을 물질로 환원하여 의식은 물질에 불과하다고 
주장하거나, 의식을 물질과 구분되는 독자적 실체로 규정함
으로써 의식과 물질의 본질적 차이를 주장한다. 전자에 의하면 
지각은 사물로부터의 감각 자극에 따른 주체의 물질적 반응으로 
이해되며, 후자에 의하면 지각은 감각된 사물에 대한 주체 즉 
의식의 판단으로 이해된다. 이처럼 양자 모두 주체와 대상의 
분리를 전제하고 지각을 이해한다. 주체와 대상은 지각 이전에 
이미 확정되어 각각 존재한다는 것이다.<br>
하지만 지각은 주체와 대상이 각자로서 존재하기 이전에 나타
나는 얽힘의 체험이다. 예를 들어 다른 사람과 손이 맞닿을 때 
내가 누군가의 손을 ⓔ 만지는 동시에 나의 손 역시 누군가에 
의해 만져진다. 감각하는 것이 동시에 감각되는 것이 되는 
얽힘의 순간에, 나는 나와 대상을 확연히 구분한다. 지각이라는 
얽힘의 작용이 있어야 주체와 대상이 분리될 수 있다. 다시 말해 
주체와 대상은 지각이 일어난 이후 비로소 확정된다. 따라서 
㉡ 지각과 감각은 서로 구분되지 않는다.<br>
지각은 물질적 반응이나 의식의 판단이 아니라, 내 몸의 체험
이다. 지각은 나의 몸에 의해 이루어지는 것이고, 지각이 이루어
지게 하는 것은 모두 나의 몸이다.
`

var columnsgo3 = Array(
    //3
    q30001,q30002,q30003,q30004,q30005,
    q30006,q30007,q30008,q30009,q30010,
    q30011,q30012,q30013,q30014,q30015
    );
var columnsgo2 = Array(
    //2
    q20001, q20002,q20003,q20004,
    q20005,q20006,q20007,q20008,
    q20009,q20010,q20011
    );
var columnsgo1 = Array(
    //1
    q10004,q10005, q10008, q10009,
    q10012,q10013,q10019,
    q10027,q10028,q10030
    );

function getRandom(min, max)
{
	return Math.floor(Math.random() * (max - min + 1) + min);
}

function selection(){
    var go1 = this.firstgrade.checked;
    var go2 = this.secondgrade.checked;
    var go3 = this.thirdgrade.checked;

    var gogogo = "1" + go1 + "2" + go2 + "3" + go3;
    
    // converter 함수를 호출하여 gooo 변수 설정
    converter(gogogo);
    
    return false;
}

function converter(gogogo){
    // 이제 gogogo 변수를 인수로 받아서 사용할 수 있음
    alert(typeof(gogogo));

    if((gogogo+"") == "1false2false3false") {
        gooo = 0;
    }
    if((gogogo+"") == "1false2false3true") {
        gooo = 4;    
        g=randomery(columnsgo3);
    }
    if((gogogo+"") == "1false2true3false") {
        gooo = 2;
        g=randomery(columnsgo2);
    }
    if((gogogo+"") == "1false2true3true") {
        gooo = 6;
    }
    if((gogogo+"") == "1true2false3false") {
        gooo = 1;
        g=randomery(columnsgo1);
    }
    if((gogogo+"") == "1true2false3true") {
        gooo = 5;
    }
    if((gogogo+"") == "1true2true3false") {
        gooo = 3;
    }
    if((gogogo+"") == "1true2true3true") {
        gooo = 7;
    }
    
    alert(gooo);
    //g=randomery(columnsgo1);
    columnize();
}


/* function selection(){
    var go1 = this.firstgrade.checked;
    var go2 = this.secondgrade.checked;
    var go3 = this.thirdgrade.checked;

    var gogogo = "1" + go1 + "2" + go2 + "3" + go3;
    
    // converter 함수를 호출하여 gooo 변수 설정
    converter(gogogo);
    
    return false;
}

function converter(gogogo){
    // 이제 gogogo 변수를 인수로 받아서 사용할 수 있음
    alert(typeof(gogogo));
    // ... 이후 코드는 그대로 두세요
}*/

/* function selection(){
    var go1=this.firstgrade.checked
    var go2=this.secondgrade.checked
    var go3=this.thirdgrade.checked

    var gogogo="1"+go1+"2"+go2+"3"+go3
    alert(gogogo)
    return false
}
*/


/* function converter(){
    alert(typeof((gogogo+"")))
    alert(typeof("1false2false3false"))
    if((gogogo+"")=="1false2false3false") {
        gooo = 0;
    }
    if((gogogo+"")=="1false2false3true") {
        gooo = 4;    
    }
    if((gogogo+"")=="1false2true3false") {
        gooo = 2;
    }
    if((gogogo+"")=="1false2true3true") {
        gooo = 6;
    }
    if((gogogo+"")=="1true2false3false") {
        gooo = 1;
    }
    if((gogogo+"")=="1true2false3true") {
        gooo = 5;
    }
    if((gogogo+"")=="1true2true3false") {
        gooo = 3;
    }
    if((gogogo+"")=="1true2true3true") {
        gooo = 7;
    }
    alert(gooo);
} */



function randomery(a){
    return a[Math.floor(Math.random() * a.length)]
}

/*function randomer(){
    if((gooo+"")=="1") {
        var a=getRandom(1,3);
    }
    alert(a);
    columnize();
}*/
function columnize(){
        document.getElementById("column").innerHTML=g;
} 
function start(){
    selection();
    //converter();
    //randomer();
    // columnize();
}
/*document.querySelector(".botton").onclick = function start(){
    selection();
    //converter();
    //randomer();
    // columnize();
}*/
/* switch(gogogo) {
        case "[1false2false3false]": {
            var gooo = 0
        }
        case "[1false2false3true]": {
            var gooo = 1
        }
        case "[1false2true3false]": {
            var gooo = 2
        }
        case "[1false2true3true]": {
            var gooo = 3
        }
        case "[1true2false3false]": {
            var gooo = 4
        }
        case "[1true2false3true]": {
            var gooo = 5
        }
        case "[1true2true3false]": {
            var gooo = 6
        }
        case "[1true2true3true]": {
            var gooo = 7
        }
    } */
/* function openTextFile(){
    var input = document.createElement("input");

}
*/
/* function columnize(){
    fetch(a+'.txt') {
        then((data) => data.text())
        then((text) => {
            console.log(text);
        })
    }
} */
/* document.getElementById('seontaeck').onclick=function selection(){
    var go1=this.firstgrade.value
    var go2=this.secondgrade.value
    var go3=this.thirdgrade.value

    var gogogo=go1+go2+go3
    alert(gogogo)
    return false
} */
/* var select = document.seontaeck.firstgrade.checked
function selection() {
    
    alert(select)
    return false
} */

//<a href="">해당모의고사바로가기</a>
